ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415kx.h
/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief Analog to Digital Converter
  */

typedef struct
{
  __IO uint32_t STS;             /*!< ADC status register,                         Address offset: 0x00 */
  __IO uint32_t CTRL1;           /*!< ADC control register 1,                      Address offset: 0x04 */
  __IO uint32_t CTRL2;           /*!< ADC control register 2,                      Address offset: 0x08 */
  __IO uint32_t SPT1;            /*!< ADC sampling time register 1,                Address offset: 0x0C */
  __IO uint32_t SPT2;            /*!< ADC sampling time register 2,                Address offset: 0x10 */
  __IO uint32_t PCDTO1;          /*!< ADC preempted channel data offset reg 1,     Address offset: 0x14 */
  __IO uint32_t PCDTO2;          /*!< ADC preempted channel data offset reg 2,     Address offset: 0x18 */
  __IO uint32_t PCDTO3;          /*!< ADC preempted channel data offset reg 3,     Address offset: 0x1C */
  __IO uint32_t PCDTO4;          /*!< ADC preempted channel data offset reg 4,     Address offset: 0x20 */
  __IO uint32_t VMHB;            /*!< ADC voltage monitor high threshold register, Address offset: 0x24 */
  __IO uint32_t VMLB;            /*!< ADC voltage monitor low threshold register,  Address offset: 0x28 */
  __IO uint32_t OSQ1;            /*!< ADC ordinary sequence register 1,            Address offset: 0x2C */
  __IO uint32_t OSQ2;            /*!< ADC ordinary sequence register 2,            Address offset: 0x30 */
  __IO uint32_t OSQ3;            /*!< ADC ordinary sequence register 3,            Address offset: 0x34 */
  __IO uint32_t PSQ;             /*!< ADC preempted sequence register,             Address offset: 0x38 */
  __IO uint32_t PDT1;            /*!< ADC preempted data register 1,               Address offset: 0x3C */
  __IO uint32_t PDT2;            /*!< ADC preempted data register 2,               Address offset: 0x40 */
  __IO uint32_t PDT3;            /*!< ADC preempted data register 3,               Address offset: 0x44 */
  __IO uint32_t PDT4;            /*!< ADC preempted data register 4,               Address offset: 0x48 */
  __IO uint32_t ODT;             /*!< ADC ordinary data register,                  Address offset: 0x4C */
} ADC_TypeDef;

/**
  * @brief Controller Area Network TX Mailbox Registers
  */

typedef struct
{
  __IO uint32_t TMI;
  __IO uint32_t TMC;
  __IO uint32_t TMDTL;
  __IO uint32_t TMDTH;
} CAN_TxMailBox_TypeDef;

/**
  * @brief Controller Area Network FIFO Mailbox Registers
  */

typedef struct
{
  __IO uint32_t RFI;
  __IO uint32_t RFC;
  __IO uint32_t RFDTL;
  __IO uint32_t RFDTH;
} CAN_FIFOMailBox_TypeDef;

/**
  * @brief Controller Area Network Filter Registers
  */

typedef struct
{
  __IO uint32_t FFB1;
  __IO uint32_t FFB2;
} CAN_FilterRegister_TypeDef;

/**
  * @brief Controller Area Network
  */

typedef struct
{
  __IO uint32_t MCTRL;                               /*!< CAN master control register,                 Address offset: 0x000         */
  __IO uint32_t MSTS;                                /*!< CAN master status register,                  Address offset: 0x004         */
  __IO uint32_t TSTS;                                /*!< CAN transmit status register,                Address offset: 0x008         */
  __IO uint32_t RF0;                                 /*!< CAN receive FIFO 0 register,                 Address offset: 0x00C         */
  __IO uint32_t RF1;                                 /*!< CAN receive FIFO 1 register,                 Address offset: 0x010         */
  __IO uint32_t INTEN;                               /*!< CAN interrupt enable register,               Address offset: 0x014         */
  __IO uint32_t ESTS;                                /*!< CAN error status register,                   Address offset: 0x018         */
  __IO uint32_t BTMG;                                /*!< CAN bit timing register,                     Address offset: 0x01C         */
  uint32_t      RESERVED0[88];                       /*!< Reserved,                                    Address offset: 0x020 ~ 0x17C */
  CAN_TxMailBox_TypeDef sTxMailBox[3];               /*!< CAN TX mailbox registers,                    Address offset: 0x180 ~ 0x1AC */
  CAN_FIFOMailBox_TypeDef sFIFOMailBox[2];           /*!< CAN FIFO mailbox registers,                  Address offset: 0x1B0 ~ 0x1CC */
  uint32_t      RESERVED1[12];                       /*!< Reserved,                                    Address offset: 0x1D0 ~ 0x1FC */
  __IO uint32_t FCTRL;                               /*!< CAN filter control register,                 Address offset: 0x200         */
  __IO uint32_t FMCFG;                               /*!< CAN filter mode configuration register,      Address offset: 0x204         */
  uint32_t      RESERVED2;                           /*!< Reserved,                                    Address offset: 0x208         */
  __IO uint32_t FBWCFG;                              /*!< CAN filter bit width configuration register, Address offset: 0x20C         */
  uint32_t      RESERVED3;                           /*!< Reserved,                                    Address offset: 0x210         */
  __IO uint32_t FRF;                                 /*!< CAN filter FIFO association register,        Address offset: 0x214         */
  uint32_t      RESERVED4;                           /*!< Reserved,                                    Address offset: 0x218         */
  __IO uint32_t FACFG;                               /*!< CAN filter activation control register,      Address offset: 0x21C         */
  uint32_t      RESERVED5[8];                        /*!< Reserved,                                    Address offset: 0x220 ~ 0x23C */
  CAN_FilterRegister_TypeDef sFilterRegister[14];    /*!< CAN filter registers,                        Address offset: 0x240 ~ 0x2AC */
} CAN_TypeDef;

/**
  * @brief Comparator
  */

typedef struct
{
  __IO uint32_t CTRLSTS1;    /*!< CMP control and status register 1,           Address offset: 0x00 */
  __IO uint32_t CTRLSTS2;    /*!< CMP control and status register 2,           Address offset: 0x04 */
} CMP_TypeDef;

/**
  * @brief CRC Calculation Unit
  */

typedef struct
{
  __IO uint32_t DT;          /*!< CRC data register,                           Address offset: 0x00 */
  __IO uint32_t CDT;         /*!< CRC common data register,                    Address offset: 0x04 */
  __IO uint32_t CTRL;        /*!< CRC control register,                        Address offset: 0x08 */
  uint32_t      RESERVED;    /*!< Reserved,                                    Address offset: 0x0C */
  __IO uint32_t IDT;         /*!< CRC initialization register,                 Address offset: 0x10 */
  __IO uint32_t POLY;        /*!< CRC polynomial register,                     Address offset: 0x14 */
} CRC_TypeDef;

/**
  * @brief Clock and Reset Manage
  */

typedef struct
{
  __IO uint32_t CTRL;            /*!< CRM clock control register,                  Address offset: 0x00        */
  __IO uint32_t CFG;             /*!< CRM clock configuration register,            Address offset: 0x04        */
  __IO uint32_t CLKINT;          /*!< CRM clock interrupt register,                Address offset: 0x08        */
  __IO uint32_t APB2RST;         /*!< CRM APB2 peripheral reset register,          Address offset: 0x0C        */
  __IO uint32_t APB1RST;         /*!< CRM APB1 peripheral reset register,          Address offset: 0x10        */
  __IO uint32_t AHBEN;           /*!< CRM AHB peripheral clock enable register,    Address offset: 0x14        */
  __IO uint32_t APB2EN;          /*!< CRM APB2 peripheral clock enable register,   Address offset: 0x18        */
  __IO uint32_t APB1EN;          /*!< CRM APB1 peripheral clock enable register,   Address offset: 0x1C        */
  __IO uint32_t BPDC;            /*!< CRM battery powered domain control register, Address offset: 0x20        */
  __IO uint32_t CTRLSTS;         /*!< CRM control/status register,                 Address offset: 0x24        */
  __IO uint32_t AHBRST;          /*!< CRM AHB peripheral reset register,           Address offset: 0x28        */
  __IO uint32_t PLL;             /*!< CRM PLL configuration register,              Address offset: 0x2C        */
  __IO uint32_t MISC1;           /*!< CRM additional register 1,                   Address offset: 0x30        */
  uint32_t      RESERVED0[4];    /*!< Reserved,                                    Address offset: 0x34 ~ 0x40 */
  __IO uint32_t OTG_EXTCTRL;     /*!< CRM OTG_FS extended control register,        Address offset: 0x44        */
  uint32_t      RESERVED1[3];    /*!< Reserved,                                    Address offset: 0x48 - 0x50 */
  __IO uint32_t MISC2;           /*!< CRM additional register 2,                   Address offset: 0x54        */
} CRM_TypeDef;

/**
  * @brief Debug MCU
  */

typedef struct
{
  __IO uint32_t IDCODE;    /*!< DEBUG device ID,                             Address offset: 0xE004_2000 */
  __IO uint32_t CTRL;      /*!< DEBUG control register,                      Address offset: 0xE004_2004 */
} DEBUG_TypeDef;

/**
  * @brief DMA Controller
  */

typedef struct
{
  __IO uint32_t CCTRL;           /*!< DMA channel x configuration register,        Address offset: 0x08 + 20 * (x - 1) (x = 1 ... 7) */
  __IO uint32_t CDTCNT;          /*!< DMA channel x number of data register,       Address offset: 0x0C + 20 * (x - 1) (x = 1 ... 7) */
  __IO uint32_t CPADDR;          /*!< DMA channel x peripheral address register,   Address offset: 0x10 + 20 * (x - 1) (x = 1 ... 7) */
  __IO uint32_t CMADDR;          /*!< DMA channel x memory address register,       Address offset: 0x14 + 20 * (x - 1) (x = 1 ... 7) */
} DMA_Channel_TypeDef;

typedef struct
{
  __IO uint32_t STS;             /*!< DMA interrupt status register,               Address offset: 0x00        */
  __IO uint32_t CLR;             /*!< DMA interrupt flag clear register,           Address offset: 0x04        */
  uint32_t      RESERVED[38];    /*!< Reserved,                                    Address offset: 0x08 ~ 0x9C */
  __IO uint32_t SRC_SEL0;        /*!< DMA channel source register 0,               Address offset: 0xA0        */
  __IO uint32_t SRC_SEL1;        /*!< DMA channel source register 1,               Address offset: 0xA4        */
} DMA_TypeDef;

/**
  * @brief Enhanced Real-Time Clock
  */

typedef struct
{
  __IO uint32_t TIME;        /*!< ERTC time register,                          Address offset: 0x00 */
  __IO uint32_t DATE;        /*!< ERTC date register,                          Address offset: 0x04 */
  __IO uint32_t CTRL;        /*!< ERTC control register,                       Address offset: 0x08 */
  __IO uint32_t STS;         /*!< ERTC initialization and status register,     Address offset: 0x0C */
  __IO uint32_t DIV;         /*!< ERTC divider register,                       Address offset: 0x10 */
  __IO uint32_t WAT;         /*!< ERTC wakeup timer register,                  Address offset: 0x14 */
  __IO uint32_t CCAL;        /*!< ERTC coarse calibration register,            Address offset: 0x18 */
  __IO uint32_t ALA;         /*!< ERTC alarm clock A register,                 Address offset: 0x1C */
  __IO uint32_t ALB;         /*!< ERTC alarm clock B register,                 Address offset: 0x20 */
  __IO uint32_t WP;          /*!< ERTC write protection register,              Address offset: 0x24 */
  __IO uint32_t SBS;         /*!< ERTC subsecond register,                     Address offset: 0x28 */
  __IO uint32_t TADJ;        /*!< ERTC time adjustment register,               Address offset: 0x2C */
  __IO uint32_t TSTM;        /*!< ERTC time stamp time register,               Address offset: 0x30 */
  __IO uint32_t TSDT;        /*!< ERTC time stamp date register,               Address offset: 0x34 */
  __IO uint32_t TSSBS;       /*!< ERTC time stamp subsecond register,          Address offset: 0x38 */
  __IO uint32_t SCAL;        /*!< ERTC smooth calibration register,            Address offset: 0x3C */
  __IO uint32_t TAMP;        /*!< ERTC tamper configuration register,          Address offset: 0x40 */
  __IO uint32_t ALASBS;      /*!< ERTC alarm clock A subsecond register,       Address offset: 0x44 */
  __IO uint32_t ALBSBS;      /*!< ERTC alarm clock B subsecond register,       Address offset: 0x48 */
  uint32_t      RESERVED;    /*!< Reserved,                                    Address offset: 0x4C */
  __IO uint32_t BPR1;        /*!< ERTC battery powered domain data register 1, Address offset: 0x50 */
  __IO uint32_t BPR2;        /*!< ERTC battery powered domain data register 2, Address offset: 0x54 */
  __IO uint32_t BPR3;        /*!< ERTC battery powered domain data register 3, Address offset: 0x58 */
  __IO uint32_t BPR4;        /*!< ERTC battery powered domain data register 4, Address offset: 0x5C */
  __IO uint32_t BPR5;        /*!< ERTC battery powered domain data register 5, Address offset: 0x60 */
  __IO uint32_t BPR6;        /*!< ERTC battery powered domain data register 6, Address offset: 0x64 */
  __IO uint32_t BPR7;        /*!< ERTC battery powered domain data register 7, Address offset: 0x68 */
  __IO uint32_t BPR8;        /*!< ERTC battery powered domain data register 8, Address offset: 0x6C */
  __IO uint32_t BPR9;        /*!< ERTC battery powered domain data register 9, Address offset: 0x70 */
  __IO uint32_t BPR10;       /*!< ERTC BAT powered domain data register 10,    Address offset: 0x74 */
  __IO uint32_t BPR11;       /*!< ERTC BAT powered domain data register 11,    Address offset: 0x78 */
  __IO uint32_t BPR12;       /*!< ERTC BAT powered domain data register 12,    Address offset: 0x7C */
  __IO uint32_t BPR13;       /*!< ERTC BAT powered domain data register 13,    Address offset: 0x80 */
  __IO uint32_t BPR14;       /*!< ERTC BAT powered domain data register 14,    Address offset: 0x84 */
  __IO uint32_t BPR15;       /*!< ERTC BAT powered domain data register 15,    Address offset: 0x88 */
  __IO uint32_t BPR16;       /*!< ERTC BAT powered domain data register 16,    Address offset: 0x8C */
  __IO uint32_t BPR17;       /*!< ERTC BAT powered domain data register 17,    Address offset: 0x90 */
  __IO uint32_t BPR18;       /*!< ERTC BAT powered domain data register 18,    Address offset: 0x94 */
  __IO uint32_t BPR19;       /*!< ERTC BAT powered domain data register 19,    Address offset: 0x98 */
  __IO uint32_t BPR20;       /*!< ERTC BAT powered domain data register 20,    Address offset: 0x9C */
} ERTC_TypeDef;

/**
  * @brief External Interrupt/Event Controller
  */

typedef struct
{
  __IO uint32_t INTEN;      /*!< EXINT interrupt enable register,             Address offset: 0x00 */
  __IO uint32_t EVTEN;      /*!< EXINT event enable register,                 Address offset: 0x04 */
  __IO uint32_t POLCFG1;    /*!< EXINT polarity configuration register 1,     Address offset: 0x08 */
  __IO uint32_t POLCFG2;    /*!< EXINT polarity configuration register 2,     Address offset: 0x0C */
  __IO uint32_t SWTRG;      /*!< EXINT software trigger register,             Address offset: 0x10 */
  __IO uint32_t INTSTS;     /*!< EXINT interrupt status register,             Address offset: 0x14 */
} EXINT_TypeDef;

/**
  * @brief Flash Memory Registers
  */

typedef struct
{
  __IO uint32_t PSR;               /*!< FLASH performance select register,           Address offset: 0x00         */
  __IO uint32_t UNLOCK;            /*!< FLASH unlock register,                       Address offset: 0x04         */
  __IO uint32_t USD_UNLOCK;        /*!< FLASH user system data unlock register,      Address offset: 0x08         */
  __IO uint32_t STS;               /*!< FLASH status register,                       Address offset: 0x0C         */
  __IO uint32_t CTRL;              /*!< FLASH control register,                      Address offset: 0x10         */
  __IO uint32_t ADDR;              /*!< FLASH address register,                      Address offset: 0x14         */
  uint32_t      RESERVED0;         /*!< Reserved,                                    Address offset: 0x18         */
  __IO uint32_t FUSD;              /*!< FLASH user system data register,             Address offset: 0x1C         */
  __IO uint32_t EPPS;              /*!< FLASH erase/program protection status reg,   Address offset: 0x20         */
  uint32_t      RESERVED1[20];     /*!< Reserved,                                    Address offset: 0x24 ~ 0x70  */
  __IO uint32_t SLIB_STS0;         /*!< FLASH security library status register 0,    Address offset: 0x74         */
  __IO uint32_t SLIB_STS1;         /*!< FLASH security library status register 1,    Address offset: 0x78         */
  __IO uint32_t SLIB_PWD_CLR;      /*!< FLASH security library password clear reg,   Address offset: 0x7C         */
  __IO uint32_t SLIB_MISC_STS;     /*!< FLASH security library additional stat reg,  Address offset: 0x80         */
  __IO uint32_t CRC_ADDR;          /*!< FLASH CRC address register,                  Address offset: 0x84         */
  __IO uint32_t CRC_CTRL;          /*!< FLASH CRC control register,                  Address offset: 0x88         */
  __IO uint32_t CRC_CHKR;          /*!< FLASH CRC check result register,             Address offset: 0x8C         */
  uint32_t      RESERVED2[52];     /*!< Reserved,                                    Address offset: 0x90 ~ 0x15C */
  __IO uint32_t SLIB_SET_PWD;      /*!< FLASH security library password setting reg, Address offset: 0x160        */
  __IO uint32_t SLIB_SET_RANGE;    /*!< FLASH security library address setting reg,  Address offset: 0x164        */
  __IO uint32_t EM_SLIB_SET;       /*!< FLASH extension mem security lib set reg,    Address offset: 0x168        */
  __IO uint32_t BTM_MODE_SET;      /*!< FLASH boot memory mode setting register,     Address offset: 0x16C        */
  __IO uint32_t SLIB_UNLOCK;       /*!< FLASH security library unlock register,      Address offset: 0x170        */
} FLASH_TypeDef;

/**
  * @brief User System Data Registers
  */

typedef struct
{
  __IO uint16_t FAP;          /*!< USD memory access protection,                Address offset: 0x1FFF_F800               */
  __IO uint16_t SSB;          /*!< USD system configuration byte,               Address offset: 0x1FFF_F802               */
  __IO uint16_t DATA0;        /*!< USD user data 0,                             Address offset: 0x1FFF_F804               */
  __IO uint16_t DATA1;        /*!< USD user data 1,                             Address offset: 0x1FFF_F806               */
  __IO uint16_t EPP0;         /*!< USD erase/write protection byte 0,           Address offset: 0x1FFF_F808               */
  __IO uint16_t EPP1;         /*!< USD erase/write protection byte 1,           Address offset: 0x1FFF_F80A               */
  __IO uint16_t EPP2;         /*!< USD erase/write protection byte 2,           Address offset: 0x1FFF_F80C               */
  __IO uint16_t EPP3;         /*!< USD erase/write protection byte 3,           Address offset: 0x1FFF_F80E               */
  __IO uint16_t DATA[504];    /*!< USD user data 2 ~ 505,                       Address offset: 0x1FFF_F810 ~ 0x1FFF_FBFC */
} USD_TypeDef;

/**
  * @brief General Purpose I/O
  */

typedef struct
{
  __IO uint32_t CFGLR;    /*!< GPIO configuration register low,             Address offset: 0x00 */
  __IO uint32_t CFGHR;    /*!< GPIO configuration register high,            Address offset: 0x04 */
  __IO uint32_t IDT;      /*!< GPIO input data register,                    Address offset: 0x08 */
  __IO uint32_t ODT;      /*!< GPIO output data register,                   Address offset: 0x0C */
  __IO uint32_t SCR;      /*!< GPIO set/clear register,                     Address offset: 0x10 */
  __IO uint32_t CLR;      /*!< GPIO clear register,                         Address offset: 0x14 */
  __IO uint32_t WPR;      /*!< GPIO write protection register,              Address offset: 0x18 */
} GPIO_TypeDef;

/**
  * @brief Multiplex Function I/O
  */

typedef struct
{
  __IO uint32_t EVTOUT;       /*!< IOMUX event output control register,         Address offset: 0x00        */
  __IO uint32_t REMAP;        /*!< IOMUX remap register 1,                      Address offset: 0x04        */
  __IO uint32_t EXINTC[4];    /*!< IOMUX external interrupt config register x,  Address offset: 0x08 ~ 0x14 */
  uint32_t      RESERVED;     /*!< Reserved,                                    Address offset: 0x18        */
  __IO uint32_t REMAP2;       /*!< IOMUX remap register 2,                      Address offset: 0x1C        */
  __IO uint32_t REMAP3;       /*!< IOMUX remap register 3,                      Address offset: 0x20        */
  __IO uint32_t REMAP4;       /*!< IOMUX remap register 4,                      Address offset: 0x24        */
  __IO uint32_t REMAP5;       /*!< IOMUX remap register 5,                      Address offset: 0x28        */
  __IO uint32_t REMAP6;       /*!< IOMUX remap register 6,                      Address offset: 0x2C        */
  __IO uint32_t REMAP7;       /*!< IOMUX remap register 7,                      Address offset: 0x30        */
  __IO uint32_t REMAP8;       /*!< IOMUX remap register 8,                      Address offset: 0x34        */
} IOMUX_TypeDef;

/**
  * @brief Inter Integrated Circuit Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< I2C control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< I2C control register 2,                      Address offset: 0x04 */
  __IO uint32_t OADDR1;     /*!< I2C own address register 1,                  Address offset: 0x08 */
  __IO uint32_t OADDR2;     /*!< I2C own address register 2,                  Address offset: 0x0C */
  __IO uint32_t DT;         /*!< I2C data register,                           Address offset: 0x10 */
  __IO uint32_t STS1;       /*!< I2C status register 1,                       Address offset: 0x14 */
  __IO uint32_t STS2;       /*!< I2C status register 2,                       Address offset: 0x18 */
  __IO uint32_t CLKCTRL;    /*!< I2C clock control register,                  Address offset: 0x1C */
  __IO uint32_t TMRISE;     /*!< I2C timer rise time register,                Address offset: 0x20 */
} I2C_TypeDef;

/**
  * @brief Power Control
  */

typedef struct
{
  __IO uint32_t CTRL;       /*!< PWC power control register,                  Address offset: 0x00 */
  __IO uint32_t CTRLSTS;    /*!< PWC power control/status register,           Address offset: 0x04 */
} PWC_TypeDef;

/**
  * @brief SD Host Interface
  */

