ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415kx.h
/******************  Bit definition for CRM_APB1EN register  ******************/
#define CRM_APB1EN_TMR2EN_Pos               (0U)
#define CRM_APB1EN_TMR2EN_Msk               (0x1U << CRM_APB1EN_TMR2EN_Pos)         /*!< 0x00000001 */
#define CRM_APB1EN_TMR2EN                   CRM_APB1EN_TMR2EN_Msk                   /*!< TMR2 clock enable */
#define CRM_APB1EN_TMR3EN_Pos               (1U)
#define CRM_APB1EN_TMR3EN_Msk               (0x1U << CRM_APB1EN_TMR3EN_Pos)         /*!< 0x00000002 */
#define CRM_APB1EN_TMR3EN                   CRM_APB1EN_TMR3EN_Msk                   /*!< TMR3 clock enable */
#define CRM_APB1EN_TMR4EN_Pos               (2U)
#define CRM_APB1EN_TMR4EN_Msk               (0x1U << CRM_APB1EN_TMR4EN_Pos)         /*!< 0x00000004 */
#define CRM_APB1EN_TMR4EN                   CRM_APB1EN_TMR4EN_Msk                   /*!< TMR4 clock enable */
#define CRM_APB1EN_TMR5EN_Pos               (3U)
#define CRM_APB1EN_TMR5EN_Msk               (0x1U << CRM_APB1EN_TMR5EN_Pos)         /*!< 0x00000008 */
#define CRM_APB1EN_TMR5EN                   CRM_APB1EN_TMR5EN_Msk                   /*!< TMR5 clock enable */
#define CRM_APB1EN_CMPEN_Pos                (9U)
#define CRM_APB1EN_CMPEN_Msk                (0x1U << CRM_APB1EN_CMPEN_Pos)          /*!< 0x00000200 */
#define CRM_APB1EN_CMPEN                    CRM_APB1EN_CMPEN_Msk                    /*!< CMP clock enable */
#define CRM_APB1EN_WWDTEN_Pos               (11U)
#define CRM_APB1EN_WWDTEN_Msk               (0x1U << CRM_APB1EN_WWDTEN_Pos)         /*!< 0x00000800 */
#define CRM_APB1EN_WWDTEN                   CRM_APB1EN_WWDTEN_Msk                   /*!< WWDT clock enable */
#define CRM_APB1EN_SPI2EN_Pos               (14U)
#define CRM_APB1EN_SPI2EN_Msk               (0x1U << CRM_APB1EN_SPI2EN_Pos)         /*!< 0x00004000 */
#define CRM_APB1EN_SPI2EN                   CRM_APB1EN_SPI2EN_Msk                   /*!< SPI2 clock enable */
#define CRM_APB1EN_USART2EN_Pos             (17U)
#define CRM_APB1EN_USART2EN_Msk             (0x1U << CRM_APB1EN_USART2EN_Pos)       /*!< 0x00020000 */
#define CRM_APB1EN_USART2EN                 CRM_APB1EN_USART2EN_Msk                 /*!< USART2 clock enable */
#define CRM_APB1EN_I2C1EN_Pos               (21U)
#define CRM_APB1EN_I2C1EN_Msk               (0x1U << CRM_APB1EN_I2C1EN_Pos)         /*!< 0x00200000 */
#define CRM_APB1EN_I2C1EN                   CRM_APB1EN_I2C1EN_Msk                   /*!< I2C1 clock enable */
#define CRM_APB1EN_I2C2EN_Pos               (22U)
#define CRM_APB1EN_I2C2EN_Msk               (0x1U << CRM_APB1EN_I2C2EN_Pos)         /*!< 0x00400000 */
#define CRM_APB1EN_I2C2EN                   CRM_APB1EN_I2C2EN_Msk                   /*!< I2C2 clock enable */
#define CRM_APB1EN_CAN1EN_Pos               (25U)
#define CRM_APB1EN_CAN1EN_Msk               (0x1U << CRM_APB1EN_CAN1EN_Pos)         /*!< 0x02000000 */
#define CRM_APB1EN_CAN1EN                   CRM_APB1EN_CAN1EN_Msk                   /*!< CAN1 clock enable */
#define CRM_APB1EN_PWCEN_Pos                (28U)
#define CRM_APB1EN_PWCEN_Msk                (0x1U << CRM_APB1EN_PWCEN_Pos)          /*!< 0x10000000 */
#define CRM_APB1EN_PWCEN                    CRM_APB1EN_PWCEN_Msk                    /*!< Power control clock enable */

/*******************  Bit definition for CRM_BPDC register  *******************/
#define CRM_BPDC_LEXTEN_Pos                 (0U)
#define CRM_BPDC_LEXTEN_Msk                 (0x1U << CRM_BPDC_LEXTEN_Pos)           /*!< 0x00000001 */
#define CRM_BPDC_LEXTEN                     CRM_BPDC_LEXTEN_Msk                     /*!< External low-speed oscillator enable */
#define CRM_BPDC_LEXTSTBL_Pos               (1U)
#define CRM_BPDC_LEXTSTBL_Msk               (0x1U << CRM_BPDC_LEXTSTBL_Pos)         /*!< 0x00000002 */
#define CRM_BPDC_LEXTSTBL                   CRM_BPDC_LEXTSTBL_Msk                   /*!< External low-speed oscillator stable */
#define CRM_BPDC_LEXTBYPS_Pos               (2U)
#define CRM_BPDC_LEXTBYPS_Msk               (0x1U << CRM_BPDC_LEXTBYPS_Pos)         /*!< 0x00000004 */
#define CRM_BPDC_LEXTBYPS                   CRM_BPDC_LEXTBYPS_Msk                   /*!< External low-speed crystal bypass */

/*!< ERTCSEL configuration */
#define CRM_BPDC_ERTCSEL_Pos                (8U)
#define CRM_BPDC_ERTCSEL_Msk                (0x3U << CRM_BPDC_ERTCSEL_Pos)          /*!< 0x00000300 */
#define CRM_BPDC_ERTCSEL                    CRM_BPDC_ERTCSEL_Msk                    /*!< ERTCSEL[1:0] bits (ERTC clock selection) */
#define CRM_BPDC_ERTCSEL_0                  (0x1U << CRM_BPDC_ERTCSEL_Pos)          /*!< 0x00000100 */
#define CRM_BPDC_ERTCSEL_1                  (0x2U << CRM_BPDC_ERTCSEL_Pos)          /*!< 0x00000200 */

#define CRM_BPDC_ERTCSEL_NOCLOCK            0x00000000U                             /*!< No clock */
#define CRM_BPDC_ERTCSEL_LEXT               0x00000100U                             /*!< LEXT */
#define CRM_BPDC_ERTCSEL_LICK               0x00000200U                             /*!< LICK */
#define CRM_BPDC_ERTCSEL_HEXT               0x00000300U                             /*!< HEXT/128 */

#define CRM_BPDC_ERTCEN_Pos                 (15U)
#define CRM_BPDC_ERTCEN_Msk                 (0x1U << CRM_BPDC_ERTCEN_Pos)           /*!< 0x00008000 */
#define CRM_BPDC_ERTCEN                     CRM_BPDC_ERTCEN_Msk                     /*!< ERTC clock enable */
#define CRM_BPDC_BPDRST_Pos                 (16U)
#define CRM_BPDC_BPDRST_Msk                 (0x1U << CRM_BPDC_BPDRST_Pos)           /*!< 0x00010000 */
#define CRM_BPDC_BPDRST                     CRM_BPDC_BPDRST_Msk                     /*!< Battery powered domain software reset */

/*****************  Bit definition for CRM_CTRLSTS register  ******************/
#define CRM_CTRLSTS_LICKEN_Pos              (0U)
#define CRM_CTRLSTS_LICKEN_Msk              (0x1U << CRM_CTRLSTS_LICKEN_Pos)        /*!< 0x00000001 */
#define CRM_CTRLSTS_LICKEN                  CRM_CTRLSTS_LICKEN_Msk                  /*!< LICK enable */
#define CRM_CTRLSTS_LICKSTBL_Pos            (1U)
#define CRM_CTRLSTS_LICKSTBL_Msk            (0x1U << CRM_CTRLSTS_LICKSTBL_Pos)      /*!< 0x00000002 */
#define CRM_CTRLSTS_LICKSTBL                CRM_CTRLSTS_LICKSTBL_Msk                /*!< LICK stable */
#define CRM_CTRLSTS_RSTFC_Pos               (24U)
#define CRM_CTRLSTS_RSTFC_Msk               (0x1U << CRM_CTRLSTS_RSTFC_Pos)         /*!< 0x01000000 */
#define CRM_CTRLSTS_RSTFC                   CRM_CTRLSTS_RSTFC_Msk                   /*!< Reset flag clear */
#define CRM_CTRLSTS_NRSTF_Pos               (26U)
#define CRM_CTRLSTS_NRSTF_Msk               (0x1U << CRM_CTRLSTS_NRSTF_Pos)         /*!< 0x04000000 */
#define CRM_CTRLSTS_NRSTF                   CRM_CTRLSTS_NRSTF_Msk                   /*!< NRST pin reset flag */
#define CRM_CTRLSTS_PORRSTF_Pos             (27U)
#define CRM_CTRLSTS_PORRSTF_Msk             (0x1U << CRM_CTRLSTS_PORRSTF_Pos)       /*!< 0x08000000 */
#define CRM_CTRLSTS_PORRSTF                 CRM_CTRLSTS_PORRSTF_Msk                 /*!< POR/LVR reset flag */
#define CRM_CTRLSTS_SWRSTF_Pos              (28U)
#define CRM_CTRLSTS_SWRSTF_Msk              (0x1U << CRM_CTRLSTS_SWRSTF_Pos)        /*!< 0x10000000 */
#define CRM_CTRLSTS_SWRSTF                  CRM_CTRLSTS_SWRSTF_Msk                  /*!< Software reset flag */
#define CRM_CTRLSTS_WDTRSTF_Pos             (29U)
#define CRM_CTRLSTS_WDTRSTF_Msk             (0x1U << CRM_CTRLSTS_WDTRSTF_Pos)       /*!< 0x20000000 */
#define CRM_CTRLSTS_WDTRSTF                 CRM_CTRLSTS_WDTRSTF_Msk                 /*!< Watchdog timer reset flag */
#define CRM_CTRLSTS_WWDTRSTF_Pos            (30U)
#define CRM_CTRLSTS_WWDTRSTF_Msk            (0x1U << CRM_CTRLSTS_WWDTRSTF_Pos)      /*!< 0x40000000 */
#define CRM_CTRLSTS_WWDTRSTF                CRM_CTRLSTS_WWDTRSTF_Msk                /*!< Window watchdog timer reset flag */
#define CRM_CTRLSTS_LPRSTF_Pos              (31U)
#define CRM_CTRLSTS_LPRSTF_Msk              (0x1U << CRM_CTRLSTS_LPRSTF_Pos)        /*!< 0x80000000 */
#define CRM_CTRLSTS_LPRSTF                  CRM_CTRLSTS_LPRSTF_Msk                  /*!< Low-power reset flag */

