ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415kx.h
/******************  Bit definition for CRM_AHBRST register  ******************/
#define CRM_AHBRST_OTGFSRST_Pos             (12U)
#define CRM_AHBRST_OTGFSRST_Msk             (0x1U << CRM_AHBRST_OTGFSRST_Pos)       /*!< 0x00001000 */
#define CRM_AHBRST_OTGFSRST                 CRM_AHBRST_OTGFSRST_Msk                 /*!< OTGFS reset */

/*******************  Bit definition for CRM_PLL register  ********************/
/*!< PLL_FR configuration */
#define CRM_PLL_PLL_FR_Pos                  (0U)
#define CRM_PLL_PLL_FR_Msk                  (0x7U << CRM_PLL_PLL_FR_Pos)            /*!< 0x00000007 */
#define CRM_PLL_PLL_FR                      CRM_PLL_PLL_FR_Msk                      /*!< PLL_FR[2:0] bits (PLL post-division factor) */
#define CRM_PLL_PLL_FR_0                    (0x1U << CRM_PLL_PLL_FR_Pos)            /*!< 0x00000001 */
#define CRM_PLL_PLL_FR_1                    (0x2U << CRM_PLL_PLL_FR_Pos)            /*!< 0x00000002 */
#define CRM_PLL_PLL_FR_2                    (0x4U << CRM_PLL_PLL_FR_Pos)            /*!< 0x00000004 */

/*!< PLL_MS configuration */
#define CRM_PLL_PLL_MS_Pos                  (4U)
#define CRM_PLL_PLL_MS_Msk                  (0xFU << CRM_PLL_PLL_MS_Pos)            /*!< 0x000000F0 */
#define CRM_PLL_PLL_MS                      CRM_PLL_PLL_MS_Msk                      /*!< PLL_MS[3:0] bits (PLL pre-division) */
#define CRM_PLL_PLL_MS_0                    (0x1U << CRM_PLL_PLL_MS_Pos)            /*!< 0x00000010 */
#define CRM_PLL_PLL_MS_1                    (0x2U << CRM_PLL_PLL_MS_Pos)            /*!< 0x00000020 */
#define CRM_PLL_PLL_MS_2                    (0x4U << CRM_PLL_PLL_MS_Pos)            /*!< 0x00000040 */
#define CRM_PLL_PLL_MS_3                    (0x8U << CRM_PLL_PLL_MS_Pos)            /*!< 0x00000080 */

/*!< PLL_NS configuration */
#define CRM_PLL_PLL_NS_Pos                  (8U)
#define CRM_PLL_PLL_NS_Msk                  (0x1FFU << CRM_PLL_PLL_NS_Pos)          /*!< 0x0001FF00 */
#define CRM_PLL_PLL_NS                      CRM_PLL_PLL_NS_Msk                      /*!< PLL_NS[8:0] bits (PLL multiplication factor) */
#define CRM_PLL_PLL_NS_0                    (0x001U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00000100 */
#define CRM_PLL_PLL_NS_1                    (0x002U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00000200 */
#define CRM_PLL_PLL_NS_2                    (0x004U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00000400 */
#define CRM_PLL_PLL_NS_3                    (0x008U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00000800 */
#define CRM_PLL_PLL_NS_4                    (0x010U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00001000 */
#define CRM_PLL_PLL_NS_5                    (0x020U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00002000 */
#define CRM_PLL_PLL_NS_6                    (0x040U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00004000 */
#define CRM_PLL_PLL_NS_7                    (0x080U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00008000 */
#define CRM_PLL_PLL_NS_8                    (0x100U << CRM_PLL_PLL_NS_Pos)          /*!< 0x00010000 */

/*!< PLL_FREF configuration */
#define CRM_PLL_PLL_FREF_Pos                (24U)
#define CRM_PLL_PLL_FREF_Msk                (0x7U << CRM_PLL_PLL_FREF_Pos)          /*!< 0x07000000 */
#define CRM_PLL_PLL_FREF                    CRM_PLL_PLL_FREF_Msk                    /*!< PLL_FREF[2:0] bits (PLL input clock selection) */
#define CRM_PLL_PLL_FREF_0                  (0x1U << CRM_PLL_PLL_FREF_Pos)          /*!< 0x01000000 */
#define CRM_PLL_PLL_FREF_1                  (0x2U << CRM_PLL_PLL_FREF_Pos)          /*!< 0x02000000 */
#define CRM_PLL_PLL_FREF_2                  (0x4U << CRM_PLL_PLL_FREF_Pos)          /*!< 0x04000000 */

#define CRM_PLL_PLL_FREF_4M                 0x00000000U                             /*!< 3.9 ~ 5 MHz */
#define CRM_PLL_PLL_FREF_6M                 0x01000000U                             /*!< 5.2 ~ 6.25 MHz */
#define CRM_PLL_PLL_FREF_8M                 0x02000000U                             /*!< 7.8125 ~ 8.33 MHz */
#define CRM_PLL_PLL_FREF_12M                0x03000000U                             /*!< 8.33 ~ 12.5 MHz */
#define CRM_PLL_PLL_FREF_16M                0x04000000U                             /*!< 15.625 ~ 20.83 MHz */
#define CRM_PLL_PLL_FREF_25M                0x05000000U                             /*!< 20.83 ~ 31.255 MHz */

#define CRM_PLL_PLLCFGEN_Pos                (31U)
#define CRM_PLL_PLLCFGEN_Msk                (0x1U << CRM_PLL_PLLCFGEN_Pos)          /*!< 0x80000000 */
#define CRM_PLL_PLLCFGEN                    CRM_PLL_PLLCFGEN_Msk                    /*!< PLL configuration enable */

/******************  Bit definition for CRM_MISC1 register  *******************/
#define CRM_MISC1_HICKCAL_KEY_Pos           (0U)
#define CRM_MISC1_HICKCAL_KEY_Msk           (0xFFU << CRM_MISC1_HICKCAL_KEY_Pos)    /*!< 0x000000FF */
#define CRM_MISC1_HICKCAL_KEY               CRM_MISC1_HICKCAL_KEY_Msk               /*!< HICK calibration key */
#define CRM_MISC1_CLKOUT_SEL_Pos            (16U)
#define CRM_MISC1_CLKOUT_SEL_Msk            (0x1U << CRM_MISC1_CLKOUT_SEL_Pos)      /*!< 0x00010000 */
#define CRM_MISC1_CLKOUT_SEL                CRM_MISC1_CLKOUT_SEL_Msk                /*!< Clock output selection */
#define CRM_MISC1_CLKFMC_SRC_Pos            (20U)
#define CRM_MISC1_CLKFMC_SRC_Msk            (0x1U << CRM_MISC1_CLKFMC_SRC_Pos)      /*!< 0x00100000 */
#define CRM_MISC1_CLKFMC_SRC                CRM_MISC1_CLKFMC_SRC_Msk                /*!< FMC clock source */
#define CRM_MISC1_HICKDIV_Pos               (25U)
#define CRM_MISC1_HICKDIV_Msk               (0x1U << CRM_MISC1_HICKDIV_Pos)         /*!< 0x02000000 */
#define CRM_MISC1_HICKDIV                   CRM_MISC1_HICKDIV_Msk                   /*!< HICK 6 divider selection */

/*!< CLKOUTDIV configuration */
#define CRM_MISC1_CLKOUTDIV_Pos             (28U)
#define CRM_MISC1_CLKOUTDIV_Msk             (0xFU << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0xF0000000 */
#define CRM_MISC1_CLKOUTDIV                 CRM_MISC1_CLKOUTDIV_Msk                 /*!< CLKOUTDIV[3:0] bits (Clock output division) */
#define CRM_MISC1_CLKOUTDIV_0               (0x1U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x10000000 */
#define CRM_MISC1_CLKOUTDIV_1               (0x2U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x20000000 */
#define CRM_MISC1_CLKOUTDIV_2               (0x4U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x40000000 */
#define CRM_MISC1_CLKOUTDIV_3               (0x8U << CRM_MISC1_CLKOUTDIV_Pos)       /*!< 0x80000000 */

