ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415kx.h
/*******************  Bit definition for GPIO_CLR register  *******************/
#define GPIO_CLR_IOCB0_Pos                  (0U)
#define GPIO_CLR_IOCB0_Msk                  (0x1U << GPIO_CLR_IOCB0_Pos)            /*!< 0x00000001 */
#define GPIO_CLR_IOCB0                      GPIO_CLR_IOCB0_Msk                      /*!< GPIO x clear bit, pin 0 */
#define GPIO_CLR_IOCB1_Pos                  (1U)
#define GPIO_CLR_IOCB1_Msk                  (0x1U << GPIO_CLR_IOCB1_Pos)            /*!< 0x00000002 */
#define GPIO_CLR_IOCB1                      GPIO_CLR_IOCB1_Msk                      /*!< GPIO x clear bit, pin 1 */
#define GPIO_CLR_IOCB2_Pos                  (2U)
#define GPIO_CLR_IOCB2_Msk                  (0x1U << GPIO_CLR_IOCB2_Pos)            /*!< 0x00000004 */
#define GPIO_CLR_IOCB2                      GPIO_CLR_IOCB2_Msk                      /*!< GPIO x clear bit, pin 2 */
#define GPIO_CLR_IOCB3_Pos                  (3U)
#define GPIO_CLR_IOCB3_Msk                  (0x1U << GPIO_CLR_IOCB3_Pos)            /*!< 0x00000008 */
#define GPIO_CLR_IOCB3                      GPIO_CLR_IOCB3_Msk                      /*!< GPIO x clear bit, pin 3 */
#define GPIO_CLR_IOCB4_Pos                  (4U)
#define GPIO_CLR_IOCB4_Msk                  (0x1U << GPIO_CLR_IOCB4_Pos)            /*!< 0x00000010 */
#define GPIO_CLR_IOCB4                      GPIO_CLR_IOCB4_Msk                      /*!< GPIO x clear bit, pin 4 */
#define GPIO_CLR_IOCB5_Pos                  (5U)
#define GPIO_CLR_IOCB5_Msk                  (0x1U << GPIO_CLR_IOCB5_Pos)            /*!< 0x00000020 */
#define GPIO_CLR_IOCB5                      GPIO_CLR_IOCB5_Msk                      /*!< GPIO x clear bit, pin 5 */
#define GPIO_CLR_IOCB6_Pos                  (6U)
#define GPIO_CLR_IOCB6_Msk                  (0x1U << GPIO_CLR_IOCB6_Pos)            /*!< 0x00000040 */
#define GPIO_CLR_IOCB6                      GPIO_CLR_IOCB6_Msk                      /*!< GPIO x clear bit, pin 6 */
#define GPIO_CLR_IOCB7_Pos                  (7U)
#define GPIO_CLR_IOCB7_Msk                  (0x1U << GPIO_CLR_IOCB7_Pos)            /*!< 0x00000080 */
#define GPIO_CLR_IOCB7                      GPIO_CLR_IOCB7_Msk                      /*!< GPIO x clear bit, pin 7 */
#define GPIO_CLR_IOCB8_Pos                  (8U)
#define GPIO_CLR_IOCB8_Msk                  (0x1U << GPIO_CLR_IOCB8_Pos)            /*!< 0x00000100 */
#define GPIO_CLR_IOCB8                      GPIO_CLR_IOCB8_Msk                      /*!< GPIO x clear bit, pin 8 */
#define GPIO_CLR_IOCB9_Pos                  (9U)
#define GPIO_CLR_IOCB9_Msk                  (0x1U << GPIO_CLR_IOCB9_Pos)            /*!< 0x00000200 */
#define GPIO_CLR_IOCB9                      GPIO_CLR_IOCB9_Msk                      /*!< GPIO x clear bit, pin 9 */
#define GPIO_CLR_IOCB10_Pos                 (10U)
#define GPIO_CLR_IOCB10_Msk                 (0x1U << GPIO_CLR_IOCB10_Pos)           /*!< 0x00000400 */
#define GPIO_CLR_IOCB10                     GPIO_CLR_IOCB10_Msk                     /*!< GPIO x clear bit, pin 10 */
#define GPIO_CLR_IOCB11_Pos                 (11U)
#define GPIO_CLR_IOCB11_Msk                 (0x1U << GPIO_CLR_IOCB11_Pos)           /*!< 0x00000800 */
#define GPIO_CLR_IOCB11                     GPIO_CLR_IOCB11_Msk                     /*!< GPIO x clear bit, pin 11 */
#define GPIO_CLR_IOCB12_Pos                 (12U)
#define GPIO_CLR_IOCB12_Msk                 (0x1U << GPIO_CLR_IOCB12_Pos)           /*!< 0x00001000 */
#define GPIO_CLR_IOCB12                     GPIO_CLR_IOCB12_Msk                     /*!< GPIO x clear bit, pin 12 */
#define GPIO_CLR_IOCB13_Pos                 (13U)
#define GPIO_CLR_IOCB13_Msk                 (0x1U << GPIO_CLR_IOCB13_Pos)           /*!< 0x00002000 */
#define GPIO_CLR_IOCB13                     GPIO_CLR_IOCB13_Msk                     /*!< GPIO x clear bit, pin 13 */
#define GPIO_CLR_IOCB14_Pos                 (14U)
#define GPIO_CLR_IOCB14_Msk                 (0x1U << GPIO_CLR_IOCB14_Pos)           /*!< 0x00004000 */
#define GPIO_CLR_IOCB14                     GPIO_CLR_IOCB14_Msk                     /*!< GPIO x clear bit, pin 14 */
#define GPIO_CLR_IOCB15_Pos                 (15U)
#define GPIO_CLR_IOCB15_Msk                 (0x1U << GPIO_CLR_IOCB15_Pos)           /*!< 0x00008000 */
#define GPIO_CLR_IOCB15                     GPIO_CLR_IOCB15_Msk                     /*!< GPIO x clear bit, pin 15 */

/*******************  Bit definition for GPIO_WPR register  *******************/
#define GPIO_WPR_WPEN0_Pos                  (0U)
#define GPIO_WPR_WPEN0_Msk                  (0x1U << GPIO_WPR_WPEN0_Pos)            /*!< 0x00000001 */
#define GPIO_WPR_WPEN0                      GPIO_WPR_WPEN0_Msk                      /*!< Write protect enable, pin 0 */
#define GPIO_WPR_WPEN1_Pos                  (1U)
#define GPIO_WPR_WPEN1_Msk                  (0x1U << GPIO_WPR_WPEN1_Pos)            /*!< 0x00000002 */
#define GPIO_WPR_WPEN1                      GPIO_WPR_WPEN1_Msk                      /*!< Write protect enable, pin 1 */
#define GPIO_WPR_WPEN2_Pos                  (2U)
#define GPIO_WPR_WPEN2_Msk                  (0x1U << GPIO_WPR_WPEN2_Pos)            /*!< 0x00000004 */
#define GPIO_WPR_WPEN2                      GPIO_WPR_WPEN2_Msk                      /*!< Write protect enable, pin 2 */
#define GPIO_WPR_WPEN3_Pos                  (3U)
#define GPIO_WPR_WPEN3_Msk                  (0x1U << GPIO_WPR_WPEN3_Pos)            /*!< 0x00000008 */
#define GPIO_WPR_WPEN3                      GPIO_WPR_WPEN3_Msk                      /*!< Write protect enable, pin 3 */
#define GPIO_WPR_WPEN4_Pos                  (4U)
#define GPIO_WPR_WPEN4_Msk                  (0x1U << GPIO_WPR_WPEN4_Pos)            /*!< 0x00000010 */
#define GPIO_WPR_WPEN4                      GPIO_WPR_WPEN4_Msk                      /*!< Write protect enable, pin 4 */
#define GPIO_WPR_WPEN5_Pos                  (5U)
#define GPIO_WPR_WPEN5_Msk                  (0x1U << GPIO_WPR_WPEN5_Pos)            /*!< 0x00000020 */
#define GPIO_WPR_WPEN5                      GPIO_WPR_WPEN5_Msk                      /*!< Write protect enable, pin 5 */
#define GPIO_WPR_WPEN6_Pos                  (6U)
#define GPIO_WPR_WPEN6_Msk                  (0x1U << GPIO_WPR_WPEN6_Pos)            /*!< 0x00000040 */
#define GPIO_WPR_WPEN6                      GPIO_WPR_WPEN6_Msk                      /*!< Write protect enable, pin 6 */
#define GPIO_WPR_WPEN7_Pos                  (7U)
#define GPIO_WPR_WPEN7_Msk                  (0x1U << GPIO_WPR_WPEN7_Pos)            /*!< 0x00000080 */
#define GPIO_WPR_WPEN7                      GPIO_WPR_WPEN7_Msk                      /*!< Write protect enable, pin 7 */
#define GPIO_WPR_WPEN8_Pos                  (8U)
#define GPIO_WPR_WPEN8_Msk                  (0x1U << GPIO_WPR_WPEN8_Pos)            /*!< 0x00000100 */
#define GPIO_WPR_WPEN8                      GPIO_WPR_WPEN8_Msk                      /*!< Write protect enable, pin 8 */
#define GPIO_WPR_WPEN9_Pos                  (9U)
#define GPIO_WPR_WPEN9_Msk                  (0x1U << GPIO_WPR_WPEN9_Pos)            /*!< 0x00000200 */
#define GPIO_WPR_WPEN9                      GPIO_WPR_WPEN9_Msk                      /*!< Write protect enable, pin 9 */
#define GPIO_WPR_WPEN10_Pos                 (10U)
#define GPIO_WPR_WPEN10_Msk                 (0x1U << GPIO_WPR_WPEN10_Pos)           /*!< 0x00000400 */
#define GPIO_WPR_WPEN10                     GPIO_WPR_WPEN10_Msk                     /*!< Write protect enable, pin 10 */
#define GPIO_WPR_WPEN11_Pos                 (11U)
#define GPIO_WPR_WPEN11_Msk                 (0x1U << GPIO_WPR_WPEN11_Pos)           /*!< 0x00000800 */
#define GPIO_WPR_WPEN11                     GPIO_WPR_WPEN11_Msk                     /*!< Write protect enable, pin 11 */
#define GPIO_WPR_WPEN12_Pos                 (12U)
#define GPIO_WPR_WPEN12_Msk                 (0x1U << GPIO_WPR_WPEN12_Pos)           /*!< 0x00001000 */
#define GPIO_WPR_WPEN12                     GPIO_WPR_WPEN12_Msk                     /*!< Write protect enable, pin 12 */
#define GPIO_WPR_WPEN13_Pos                 (13U)
#define GPIO_WPR_WPEN13_Msk                 (0x1U << GPIO_WPR_WPEN13_Pos)           /*!< 0x00002000 */
#define GPIO_WPR_WPEN13                     GPIO_WPR_WPEN13_Msk                     /*!< Write protect enable, pin 13 */
#define GPIO_WPR_WPEN14_Pos                 (14U)
#define GPIO_WPR_WPEN14_Msk                 (0x1U << GPIO_WPR_WPEN14_Pos)           /*!< 0x00004000 */
#define GPIO_WPR_WPEN14                     GPIO_WPR_WPEN14_Msk                     /*!< Write protect enable, pin 14 */
#define GPIO_WPR_WPEN15_Pos                 (15U)
#define GPIO_WPR_WPEN15_Msk                 (0x1U << GPIO_WPR_WPEN15_Pos)           /*!< 0x00008000 */
#define GPIO_WPR_WPEN15                     GPIO_WPR_WPEN15_Msk                     /*!< Write protect enable, pin 15 */
#define GPIO_WPR_WPSEQ_Pos                  (16U)
#define GPIO_WPR_WPSEQ_Msk                  (0x1U << GPIO_WPR_WPSEQ_Pos)            /*!< 0x00010000 */
#define GPIO_WPR_WPSEQ                      GPIO_WPR_WPSEQ_Msk                      /*!< Write protect sequence */

/******************************************************************************/
/*                                                                            */
/*                      Multiplex function I/Os (IOMUX)                       */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for IOMUX_EVTOUT register  *****************/
/*!< SELPIN configuration */
#define IOMUX_EVTOUT_SELPIN_Pos             (0U)
#define IOMUX_EVTOUT_SELPIN_Msk             (0xFU << IOMUX_EVTOUT_SELPIN_Pos)       /*!< 0x0000000F */
#define IOMUX_EVTOUT_SELPIN                 IOMUX_EVTOUT_SELPIN_Msk                 /*!< SELPIN[3:0] bits (Selection IO pin) */
#define IOMUX_EVTOUT_SELPIN_0               (0x1U << IOMUX_EVTOUT_SELPIN_Pos)       /*!< 0x00000001 */
#define IOMUX_EVTOUT_SELPIN_1               (0x2U << IOMUX_EVTOUT_SELPIN_Pos)       /*!< 0x00000002 */
#define IOMUX_EVTOUT_SELPIN_2               (0x4U << IOMUX_EVTOUT_SELPIN_Pos)       /*!< 0x00000004 */
#define IOMUX_EVTOUT_SELPIN_3               (0x8U << IOMUX_EVTOUT_SELPIN_Pos)       /*!< 0x00000008 */

#define IOMUX_EVTOUT_SELPIN_PIN0            0x00000000U                             /*!< Pin 0 */
#define IOMUX_EVTOUT_SELPIN_PIN1_Pos        (0U)
#define IOMUX_EVTOUT_SELPIN_PIN1_Msk        (0x1U << IOMUX_EVTOUT_SELPIN_PIN1_Pos)  /*!< 0x00000001 */
#define IOMUX_EVTOUT_SELPIN_PIN1            IOMUX_EVTOUT_SELPIN_PIN1_Msk            /*!< Pin 1 */
#define IOMUX_EVTOUT_SELPIN_PIN2_Pos        (1U)
#define IOMUX_EVTOUT_SELPIN_PIN2_Msk        (0x1U << IOMUX_EVTOUT_SELPIN_PIN2_Pos)  /*!< 0x00000002 */
#define IOMUX_EVTOUT_SELPIN_PIN2            IOMUX_EVTOUT_SELPIN_PIN2_Msk            /*!< Pin 2 */
#define IOMUX_EVTOUT_SELPIN_PIN3_Pos        (0U)
#define IOMUX_EVTOUT_SELPIN_PIN3_Msk        (0x3U << IOMUX_EVTOUT_SELPIN_PIN3_Pos)  /*!< 0x00000003 */
#define IOMUX_EVTOUT_SELPIN_PIN3            IOMUX_EVTOUT_SELPIN_PIN3_Msk            /*!< Pin 3 */
#define IOMUX_EVTOUT_SELPIN_PIN4_Pos        (2U)
#define IOMUX_EVTOUT_SELPIN_PIN4_Msk        (0x1U << IOMUX_EVTOUT_SELPIN_PIN4_Pos)  /*!< 0x00000004 */
#define IOMUX_EVTOUT_SELPIN_PIN4            IOMUX_EVTOUT_SELPIN_PIN4_Msk            /*!< Pin 4 */
#define IOMUX_EVTOUT_SELPIN_PIN5_Pos        (0U)
#define IOMUX_EVTOUT_SELPIN_PIN5_Msk        (0x5U << IOMUX_EVTOUT_SELPIN_PIN5_Pos)  /*!< 0x00000005 */
#define IOMUX_EVTOUT_SELPIN_PIN5            IOMUX_EVTOUT_SELPIN_PIN5_Msk            /*!< Pin 5 */
#define IOMUX_EVTOUT_SELPIN_PIN6_Pos        (1U)
#define IOMUX_EVTOUT_SELPIN_PIN6_Msk        (0x3U << IOMUX_EVTOUT_SELPIN_PIN6_Pos)  /*!< 0x00000006 */
#define IOMUX_EVTOUT_SELPIN_PIN6            IOMUX_EVTOUT_SELPIN_PIN6_Msk            /*!< Pin 6 */
#define IOMUX_EVTOUT_SELPIN_PIN7_Pos        (0U)
#define IOMUX_EVTOUT_SELPIN_PIN7_Msk        (0x7U << IOMUX_EVTOUT_SELPIN_PIN7_Pos)  /*!< 0x00000007 */
#define IOMUX_EVTOUT_SELPIN_PIN7            IOMUX_EVTOUT_SELPIN_PIN7_Msk            /*!< Pin 7 */
#define IOMUX_EVTOUT_SELPIN_PIN8_Pos        (3U)
#define IOMUX_EVTOUT_SELPIN_PIN8_Msk        (0x1U << IOMUX_EVTOUT_SELPIN_PIN8_Pos)  /*!< 0x00000008 */
#define IOMUX_EVTOUT_SELPIN_PIN8            IOMUX_EVTOUT_SELPIN_PIN8_Msk            /*!< Pin 8 */
#define IOMUX_EVTOUT_SELPIN_PIN9_Pos        (0U)
#define IOMUX_EVTOUT_SELPIN_PIN9_Msk        (0x9U << IOMUX_EVTOUT_SELPIN_PIN9_Pos)  /*!< 0x00000009 */
#define IOMUX_EVTOUT_SELPIN_PIN9            IOMUX_EVTOUT_SELPIN_PIN9_Msk            /*!< Pin 9 */
#define IOMUX_EVTOUT_SELPIN_PIN10_Pos       (1U)
#define IOMUX_EVTOUT_SELPIN_PIN10_Msk       (0x5U << IOMUX_EVTOUT_SELPIN_PIN10_Pos) /*!< 0x0000000A */
#define IOMUX_EVTOUT_SELPIN_PIN10           IOMUX_EVTOUT_SELPIN_PIN10_Msk           /*!< Pin 10 */
#define IOMUX_EVTOUT_SELPIN_PIN11_Pos       (0U)
#define IOMUX_EVTOUT_SELPIN_PIN11_Msk       (0xBU << IOMUX_EVTOUT_SELPIN_PIN11_Pos) /*!< 0x0000000B */
#define IOMUX_EVTOUT_SELPIN_PIN11           IOMUX_EVTOUT_SELPIN_PIN11_Msk           /*!< Pin 11 */
#define IOMUX_EVTOUT_SELPIN_PIN12_Pos       (2U)
#define IOMUX_EVTOUT_SELPIN_PIN12_Msk       (0x3U << IOMUX_EVTOUT_SELPIN_PIN12_Pos) /*!< 0x0000000C */
#define IOMUX_EVTOUT_SELPIN_PIN12           IOMUX_EVTOUT_SELPIN_PIN12_Msk           /*!< Pin 12 */
#define IOMUX_EVTOUT_SELPIN_PIN13_Pos       (0U)
#define IOMUX_EVTOUT_SELPIN_PIN13_Msk       (0xDU << IOMUX_EVTOUT_SELPIN_PIN13_Pos) /*!< 0x0000000D */
#define IOMUX_EVTOUT_SELPIN_PIN13           IOMUX_EVTOUT_SELPIN_PIN13_Msk           /*!< Pin 13 */
#define IOMUX_EVTOUT_SELPIN_PIN14_Pos       (1U)
#define IOMUX_EVTOUT_SELPIN_PIN14_Msk       (0x7U << IOMUX_EVTOUT_SELPIN_PIN14_Pos) /*!< 0x0000000E */
#define IOMUX_EVTOUT_SELPIN_PIN14           IOMUX_EVTOUT_SELPIN_PIN14_Msk           /*!< Pin 14 */
#define IOMUX_EVTOUT_SELPIN_PIN15_Pos       (0U)
#define IOMUX_EVTOUT_SELPIN_PIN15_Msk       (0xFU << IOMUX_EVTOUT_SELPIN_PIN15_Pos) /*!< 0x0000000F */
#define IOMUX_EVTOUT_SELPIN_PIN15           IOMUX_EVTOUT_SELPIN_PIN15_Msk           /*!< Pin 15 */

/*!< SELPORT configuration */
#define IOMUX_EVTOUT_SELPORT_Pos            (4U)
#define IOMUX_EVTOUT_SELPORT_Msk            (0x7U << IOMUX_EVTOUT_SELPORT_Pos)      /*!< 0x00000070 */
#define IOMUX_EVTOUT_SELPORT                IOMUX_EVTOUT_SELPORT_Msk                /*!< SELPORT[2:0] bits (Selection IO port) */
#define IOMUX_EVTOUT_SELPORT_0              (0x1U << IOMUX_EVTOUT_SELPORT_Pos)      /*!< 0x00000010 */
#define IOMUX_EVTOUT_SELPORT_1              (0x2U << IOMUX_EVTOUT_SELPORT_Pos)      /*!< 0x00000020 */
#define IOMUX_EVTOUT_SELPORT_2              (0x4U << IOMUX_EVTOUT_SELPORT_Pos)      /*!< 0x00000040 */

#define IOMUX_EVTOUT_SELPORT_GPIOA          0x00000000                              /*!< GPIOA */
#define IOMUX_EVTOUT_SELPORT_GPIOB_Pos      (4U)                                    /*!< 0x00000010 */
#define IOMUX_EVTOUT_SELPORT_GPIOB_Msk      (0x1U << IOMUX_EVTOUT_SELPORT_GPIOB_Pos)
#define IOMUX_EVTOUT_SELPORT_GPIOB          IOMUX_EVTOUT_SELPORT_GPIOB_Msk          /*!< GPIOB */
#define IOMUX_EVTOUT_SELPORT_GPIOC_Pos      (5U)                                    /*!< 0x00000020 */
#define IOMUX_EVTOUT_SELPORT_GPIOC_Msk      (0x1U << IOMUX_EVTOUT_SELPORT_GPIOC_Pos)
#define IOMUX_EVTOUT_SELPORT_GPIOC          IOMUX_EVTOUT_SELPORT_GPIOC_Msk          /*!< GPIOC */
#define IOMUX_EVTOUT_SELPORT_GPIOD_Pos      (4U)                                    /*!< 0x00000030 */
#define IOMUX_EVTOUT_SELPORT_GPIOD_Msk      (0x3U << IOMUX_EVTOUT_SELPORT_GPIOD_Pos)
#define IOMUX_EVTOUT_SELPORT_GPIOD          IOMUX_EVTOUT_SELPORT_GPIOD_Msk          /*!< GPIOD */
#define IOMUX_EVTOUT_SELPORT_GPIOF_Pos      (4U)                                    /*!< 0x00000050 */
#define IOMUX_EVTOUT_SELPORT_GPIOF_Msk      (0x5U << IOMUX_EVTOUT_SELPORT_GPIOF_Pos)
#define IOMUX_EVTOUT_SELPORT_GPIOF          IOMUX_EVTOUT_SELPORT_GPIOF_Msk          /*!< GPIOF */

#define IOMUX_EVTOUT_EVOEN_Pos              (7U)
#define IOMUX_EVTOUT_EVOEN_Msk              (0x1U << IOMUX_EVTOUT_EVOEN_Pos)        /*!< 0x00000080 */
#define IOMUX_EVTOUT_EVOEN                  IOMUX_EVTOUT_EVOEN_Msk                  /*!< Event output enable */

/*****************  Bit definition for IOMUX_REMAP register  ******************/
#define IOMUX_REMAP_SPI1_MUX_Pos            (0U)
#define IOMUX_REMAP_SPI1_MUX_Msk            (0x1U << IOMUX_REMAP_SPI1_MUX_Pos)      /*!< 0x00000001 */
#define IOMUX_REMAP_SPI1_MUX                IOMUX_REMAP_SPI1_MUX_Msk                /*!< SPI1 IO multiplexing */
#define IOMUX_REMAP_I2C1_MUX_Pos            (1U)
#define IOMUX_REMAP_I2C1_MUX_Msk            (0x1U << IOMUX_REMAP_I2C1_MUX_Pos)      /*!< 0x00000002 */
#define IOMUX_REMAP_I2C1_MUX                IOMUX_REMAP_I2C1_MUX_Msk                /*!< I2C1 IO multiplexing */
#define IOMUX_REMAP_USART1_MUX_Pos          (2U)
#define IOMUX_REMAP_USART1_MUX_Msk          (0x1U << IOMUX_REMAP_USART1_MUX_Pos)    /*!< 0x00000004 */
#define IOMUX_REMAP_USART1_MUX              IOMUX_REMAP_USART1_MUX_Msk              /*!< USART1 IO multiplexing */

/*!< TMR1_MUX configuration */
#define IOMUX_REMAP_TMR1_MUX_Pos            (6U)
#define IOMUX_REMAP_TMR1_MUX_Msk            (0x3U << IOMUX_REMAP_TMR1_MUX_Pos)      /*!< 0x000000C0 */
#define IOMUX_REMAP_TMR1_MUX                IOMUX_REMAP_TMR1_MUX_Msk                /*!< TMR1_MUX[1:0] bits (TMR1 IO multiplexing) */
#define IOMUX_REMAP_TMR1_MUX_0              (0x1U << IOMUX_REMAP_TMR1_MUX_Pos)      /*!< 0x00000040 */
#define IOMUX_REMAP_TMR1_MUX_1              (0x2U << IOMUX_REMAP_TMR1_MUX_Pos)      /*!< 0x00000080 */

