ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415kx.h
/*!< TMR5_GMUX configuration */
#define IOMUX_REMAP4_TMR5_GMUX_Pos          (16U)
#define IOMUX_REMAP4_TMR5_GMUX_Msk          (0x7U << IOMUX_REMAP4_TMR5_GMUX_Pos)    /*!< 0x00070000 */
#define IOMUX_REMAP4_TMR5_GMUX              IOMUX_REMAP4_TMR5_GMUX_Msk              /*!< TMR5_GMUX[2:0] bits (TMR5 IO general multiplexing) */
#define IOMUX_REMAP4_TMR5_GMUX_0            (0x1U << IOMUX_REMAP4_TMR5_GMUX_Pos)    /*!< 0x00010000 */
#define IOMUX_REMAP4_TMR5_GMUX_1            (0x2U << IOMUX_REMAP4_TMR5_GMUX_Pos)    /*!< 0x00020000 */
#define IOMUX_REMAP4_TMR5_GMUX_2            (0x4U << IOMUX_REMAP4_TMR5_GMUX_Pos)    /*!< 0x00040000 */

#define IOMUX_REMAP4_TMR5_GMUX_MUX0         0x00000000U                             /*!< CH1/PA0, CH2/PA1, CH3/PA2, CH4/PA3 */
#define IOMUX_REMAP4_TMR5_GMUX_MUX1_Pos     (16U)                                   /*!< 0x00010000 */
#define IOMUX_REMAP4_TMR5_GMUX_MUX1_Msk     (0x1U << IOMUX_REMAP4_TMR5_GMUX_MUX1_Pos)
#define IOMUX_REMAP4_TMR5_GMUX_MUX1         IOMUX_REMAP4_TMR5_GMUX_MUX1_Msk         /*!< CH1/PF4, CH2/PF5, CH3/PA2, CH4/PA3 */

#define IOMUX_REMAP4_TMR5CH4_GMUX_Pos       (19U)
#define IOMUX_REMAP4_TMR5CH4_GMUX_Msk       (0x1U << IOMUX_REMAP4_TMR5CH4_GMUX_Pos) /*!< 0x00080000 */
#define IOMUX_REMAP4_TMR5CH4_GMUX           IOMUX_REMAP4_TMR5CH4_GMUX_Msk           /*!< TMR5_CH4 general multiplexing */

/*****************  Bit definition for IOMUX_REMAP5 register  *****************/
/*!< I2C1_GMUX configuration */
#define IOMUX_REMAP5_I2C1_GMUX_Pos          (4U)
#define IOMUX_REMAP5_I2C1_GMUX_Msk          (0xFU << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x000000F0 */
#define IOMUX_REMAP5_I2C1_GMUX              IOMUX_REMAP5_I2C1_GMUX_Msk              /*!< I2C1_GMUX[3:0] bits (I2C1 IO general multiplexing) */
#define IOMUX_REMAP5_I2C1_GMUX_0            (0x1U << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x00000010 */
#define IOMUX_REMAP5_I2C1_GMUX_1            (0x2U << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x00000020 */
#define IOMUX_REMAP5_I2C1_GMUX_2            (0x4U << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x00000040 */
#define IOMUX_REMAP5_I2C1_GMUX_3            (0x8U << IOMUX_REMAP5_I2C1_GMUX_Pos)    /*!< 0x00000080 */

#define IOMUX_REMAP5_I2C1_GMUX_MUX0         0x00000000U                             /*!< SCL/PB6, SDA/PB7, SMBA/PB5 */
#define IOMUX_REMAP5_I2C1_GMUX_MUX1_Pos     (4U)                                    /*!< 0x00000010 */
#define IOMUX_REMAP5_I2C1_GMUX_MUX1_Msk     (0x1U << IOMUX_REMAP5_I2C1_GMUX_MUX1_Pos)
#define IOMUX_REMAP5_I2C1_GMUX_MUX1         IOMUX_REMAP5_I2C1_GMUX_MUX1_Msk         /*!< SCL/PB8, SDA/PB9, SMBA/PB5 */
#define IOMUX_REMAP5_I2C1_GMUX_MUX2_Pos     (5U)                                    /*!< 0x00000020 */
#define IOMUX_REMAP5_I2C1_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP5_I2C1_GMUX_MUX2_Pos)
#define IOMUX_REMAP5_I2C1_GMUX_MUX2         IOMUX_REMAP5_I2C1_GMUX_MUX2_Msk         /*!< SCL/PF6, SDA/PF7, SMBA/PB5 */

/*!< I2C2_GMUX configuration */
#define IOMUX_REMAP5_I2C2_GMUX_Pos          (8U)
#define IOMUX_REMAP5_I2C2_GMUX_Msk          (0xFU << IOMUX_REMAP5_I2C2_GMUX_Pos)    /*!< 0x00000F00 */
#define IOMUX_REMAP5_I2C2_GMUX              IOMUX_REMAP5_I2C2_GMUX_Msk              /*!< I2C2_GMUX[3:0] bits (I2C2 IO general multiplexing) */
#define IOMUX_REMAP5_I2C2_GMUX_0            (0x1U << IOMUX_REMAP5_I2C2_GMUX_Pos)    /*!< 0x00000100 */
#define IOMUX_REMAP5_I2C2_GMUX_1            (0x2U << IOMUX_REMAP5_I2C2_GMUX_Pos)    /*!< 0x00000200 */
#define IOMUX_REMAP5_I2C2_GMUX_2            (0x4U << IOMUX_REMAP5_I2C2_GMUX_Pos)    /*!< 0x00000400 */
#define IOMUX_REMAP5_I2C2_GMUX_3            (0x8U << IOMUX_REMAP5_I2C2_GMUX_Pos)    /*!< 0x00000800 */

#define IOMUX_REMAP5_I2C2_GMUX_MUX0         0x00000000U                             /*!< SCL/PB10, SDA/PB11, SMBA/PB12 */
#define IOMUX_REMAP5_I2C2_GMUX_MUX1_Pos     (8U)                                    /*!< 0x00000100 */
#define IOMUX_REMAP5_I2C2_GMUX_MUX1_Msk     (0x1U << IOMUX_REMAP5_I2C2_GMUX_MUX1_Pos)
#define IOMUX_REMAP5_I2C2_GMUX_MUX1         IOMUX_REMAP5_I2C2_GMUX_MUX1_Msk         /*!< SCL/PA8, SDA/PC9, SMBA/PA9 */
#define IOMUX_REMAP5_I2C2_GMUX_MUX2_Pos     (9U)                                    /*!< 0x00000200 */
#define IOMUX_REMAP5_I2C2_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP5_I2C2_GMUX_MUX2_Pos)
#define IOMUX_REMAP5_I2C2_GMUX_MUX2         IOMUX_REMAP5_I2C2_GMUX_MUX2_Msk         /*!< SCL/PA8, SDA/PB4, SMBA/PA9 */
#define IOMUX_REMAP5_I2C2_GMUX_MUX3_Pos     (8U)                                    /*!< 0x00000300 */
#define IOMUX_REMAP5_I2C2_GMUX_MUX3_Msk     (0x3U << IOMUX_REMAP5_I2C2_GMUX_MUX3_Pos)
#define IOMUX_REMAP5_I2C2_GMUX_MUX3         IOMUX_REMAP5_I2C2_GMUX_MUX3_Msk         /*!< SCL/PF6, SDA/PF7, SMBA/PA9 */

/*!< SPI1_GMUX configuration */
#define IOMUX_REMAP5_SPI1_GMUX_Pos          (16U)
#define IOMUX_REMAP5_SPI1_GMUX_Msk          (0xFU << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x000F0000 */
#define IOMUX_REMAP5_SPI1_GMUX              IOMUX_REMAP5_SPI1_GMUX_Msk              /*!< SPI1_GMUX[3:0] bits (SPI1 IO general multiplexing) */
#define IOMUX_REMAP5_SPI1_GMUX_0            (0x1U << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x00010000 */
#define IOMUX_REMAP5_SPI1_GMUX_1            (0x2U << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x00020000 */
#define IOMUX_REMAP5_SPI1_GMUX_2            (0x4U << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x00040000 */
#define IOMUX_REMAP5_SPI1_GMUX_3            (0x8U << IOMUX_REMAP5_SPI1_GMUX_Pos)    /*!< 0x00080000 */

#define IOMUX_REMAP5_SPI1_GMUX_MUX0         0x00000000U                             /*!< CS/PA4, SCK/PA5, MISO/PA6, MOSI/PA7, MCK/PB0 */
#define IOMUX_REMAP5_SPI1_GMUX_MUX1_Pos     (16U)                                   /*!< 0x00010000 */
#define IOMUX_REMAP5_SPI1_GMUX_MUX1_Msk     (0x1U << IOMUX_REMAP5_SPI1_GMUX_MUX1_Pos)
#define IOMUX_REMAP5_SPI1_GMUX_MUX1         IOMUX_REMAP5_SPI1_GMUX_MUX1_Msk         /*!< CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5, MCK/PB6 */

/*!< SPI2_GMUX configuration */
#define IOMUX_REMAP5_SPI2_GMUX_Pos          (20U)
#define IOMUX_REMAP5_SPI2_GMUX_Msk          (0xFU << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00F00000 */
#define IOMUX_REMAP5_SPI2_GMUX              IOMUX_REMAP5_SPI2_GMUX_Msk              /*!< SPI2_GMUX[3:0] bits (SPI2 IO general multiplexing) */
#define IOMUX_REMAP5_SPI2_GMUX_0            (0x1U << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00100000 */
#define IOMUX_REMAP5_SPI2_GMUX_1            (0x2U << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00200000 */
#define IOMUX_REMAP5_SPI2_GMUX_2            (0x4U << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00400000 */
#define IOMUX_REMAP5_SPI2_GMUX_3            (0x8U << IOMUX_REMAP5_SPI2_GMUX_Pos)    /*!< 0x00800000 */

#define IOMUX_REMAP5_SPI2_GMUX_MUX0         0x00000000U                             /*!< CS/PB12, SCK/PB13, MISO/PB14, MOSI/PB15, MCK/PC6 */
#define IOMUX_REMAP5_SPI2_GMUX_MUX1_Pos     (20U)                                   /*!< 0x00100000 */
#define IOMUX_REMAP5_SPI2_GMUX_MUX1_Msk     (0x1U << IOMUX_REMAP5_SPI2_GMUX_MUX1_Pos)
#define IOMUX_REMAP5_SPI2_GMUX_MUX1         IOMUX_REMAP5_SPI2_GMUX_MUX1_Msk         /*!< CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5, MCK/PC7 */

/*****************  Bit definition for IOMUX_REMAP6 register  *****************/
/*!< CAN1_GMUX configuration */
#define IOMUX_REMAP6_CAN1_GMUX_Pos          (0U)
#define IOMUX_REMAP6_CAN1_GMUX_Msk          (0xFU << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x0000000F */
#define IOMUX_REMAP6_CAN1_GMUX              IOMUX_REMAP6_CAN1_GMUX_Msk              /*!< CAN1_GMUX[3:0] bits (CAN1 IO general multiplexing) */
#define IOMUX_REMAP6_CAN1_GMUX_0            (0x1U << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x00000001 */
#define IOMUX_REMAP6_CAN1_GMUX_1            (0x2U << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x00000002 */
#define IOMUX_REMAP6_CAN1_GMUX_2            (0x4U << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x00000004 */
#define IOMUX_REMAP6_CAN1_GMUX_3            (0x8U << IOMUX_REMAP6_CAN1_GMUX_Pos)    /*!< 0x00000008 */

