ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415kx.h
/******************  Bit definition for DMA_CPADDR register  ******************/
#define DMA_CPADDR_PADDR_Pos                (0U)
#define DMA_CPADDR_PADDR_Msk                (0xFFFFFFFFU << DMA_CPADDR_PADDR_Pos)   /*!< 0xFFFFFFFF */
#define DMA_CPADDR_PADDR                    DMA_CPADDR_PADDR_Msk                    /*!< Peripheral base address */

/******************  Bit definition for DMA_CMADDR register  ******************/
#define DMA_CMADDR_MADDR_Pos                (0U)
#define DMA_CMADDR_MADDR_Msk                (0xFFFFFFFFU << DMA_CMADDR_MADDR_Pos)   /*!< 0xFFFFFFFF */
#define DMA_CMADDR_MADDR                    DMA_CMADDR_MADDR_Msk                    /*!< Memory base address */

/*****************  Bit definition for DMA_SRC_SEL0 register  *****************/
#define DMA_SRC_SEL0_CH1_SRC_Pos            (0U)
#define DMA_SRC_SEL0_CH1_SRC_Msk            (0xFFU << DMA_SRC_SEL0_CH1_SRC_Pos)     /*!< 0x000000FF */
#define DMA_SRC_SEL0_CH1_SRC                DMA_SRC_SEL0_CH1_SRC_Msk                /*!< CH1 source select */
#define DMA_SRC_SEL0_CH2_SRC_Pos            (8U)
#define DMA_SRC_SEL0_CH2_SRC_Msk            (0xFFU << DMA_SRC_SEL0_CH2_SRC_Pos)     /*!< 0x0000FF00 */
#define DMA_SRC_SEL0_CH2_SRC                DMA_SRC_SEL0_CH2_SRC_Msk                /*!< CH2 source select */
#define DMA_SRC_SEL0_CH3_SRC_Pos            (16U)
#define DMA_SRC_SEL0_CH3_SRC_Msk            (0xFFU << DMA_SRC_SEL0_CH3_SRC_Pos)     /*!< 0x00FF0000 */
#define DMA_SRC_SEL0_CH3_SRC                DMA_SRC_SEL0_CH3_SRC_Msk                /*!< CH3 source select */
#define DMA_SRC_SEL0_CH4_SRC_Pos            (24U)
#define DMA_SRC_SEL0_CH4_SRC_Msk            (0xFFU << DMA_SRC_SEL0_CH4_SRC_Pos)     /*!< 0xFF000000 */
#define DMA_SRC_SEL0_CH4_SRC                DMA_SRC_SEL0_CH4_SRC_Msk                /*!< CH4 source select */

/*****************  Bit definition for DMA_SRC_SEL1 register  *****************/
#define DMA_SRC_SEL1_CH5_SRC_Pos            (0U)
#define DMA_SRC_SEL1_CH5_SRC_Msk            (0xFFU << DMA_SRC_SEL1_CH5_SRC_Pos)     /*!< 0x000000FF */
#define DMA_SRC_SEL1_CH5_SRC                DMA_SRC_SEL1_CH5_SRC_Msk                /*!< CH5 source select */
#define DMA_SRC_SEL1_CH6_SRC_Pos            (8U)
#define DMA_SRC_SEL1_CH6_SRC_Msk            (0xFFU << DMA_SRC_SEL1_CH6_SRC_Pos)     /*!< 0x0000FF00 */
#define DMA_SRC_SEL1_CH6_SRC                DMA_SRC_SEL1_CH6_SRC_Msk                /*!< CH6 source select */
#define DMA_SRC_SEL1_CH7_SRC_Pos            (16U)
#define DMA_SRC_SEL1_CH7_SRC_Msk            (0xFFU << DMA_SRC_SEL1_CH7_SRC_Pos)     /*!< 0x00FF0000 */
#define DMA_SRC_SEL1_CH7_SRC                DMA_SRC_SEL1_CH7_SRC_Msk                /*!< CH7 source select */
#define DMA_SRC_SEL1_DMA_FLEX_EN_Pos        (24U)
#define DMA_SRC_SEL1_DMA_FLEX_EN_Msk        (0x1U << DMA_SRC_SEL1_DMA_FLEX_EN_Pos)  /*!< 0x01000000 */
#define DMA_SRC_SEL1_DMA_FLEX_EN            DMA_SRC_SEL1_DMA_FLEX_EN_Msk            /*!< DMA flexible request mapping enable */

/******************************************************************************/
/*                                                                            */
/*                         CRC calculation unit (CRC)                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for CRC_DT register  ********************/
#define CRC_DT_DT_Pos                       (0U)
#define CRC_DT_DT_Msk                       (0xFFFFFFFFU << CRC_DT_DT_Pos)          /*!< 0xFFFFFFFF */
#define CRC_DT_DT                           CRC_DT_DT_Msk                           /*!< Data register bits */

/*******************  Bit definition for CRC_CDT register  ********************/
#define CRC_CDT_CDT_Pos                     (0U)
#define CRC_CDT_CDT_Msk                     (0xFFU << CRC_CDT_CDT_Pos)              /*!< 0x000000FF */
#define CRC_CDT_CDT                         CRC_CDT_CDT_Msk                         /*!< General-purpose 8-bit data register bits */

/*******************  Bit definition for CRC_CTRL register  *******************/
#define CRC_CTRL_RST_Pos                    (0U)
#define CRC_CTRL_RST_Msk                    (0x1U << CRC_CTRL_RST_Pos)              /*!< 0x00000001 */
#define CRC_CTRL_RST                        CRC_CTRL_RST_Msk                        /*!< Reset CRC calculation unit */

/*!< POLY_SIZE configuration */
#define CRC_CTRL_POLY_SIZE_Pos              (3U)
#define CRC_CTRL_POLY_SIZE_Msk              (0x3U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000018 */
#define CRC_CTRL_POLY_SIZE                  CRC_CTRL_POLY_SIZE_Msk                  /*!< POLY_SIZE[1:0] bits (Polynomial size) */
#define CRC_CTRL_POLY_SIZE_0                (0x1U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000008 */
#define CRC_CTRL_POLY_SIZE_1                (0x2U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000010 */

#define CRC_CTRL_POLY_SIZE_32BITS           0x00000000U                             /*!< 32 bits */
#define CRC_CTRL_POLY_SIZE_16BITS_Pos       (3U)
#define CRC_CTRL_POLY_SIZE_16BITS_Msk       (0x1U << CRC_CTRL_POLY_SIZE_16BITS_Pos) /*!< 0x00000008 */
#define CRC_CTRL_POLY_SIZE_16BITS           CRC_CTRL_POLY_SIZE_16BITS_Msk           /*!< 16 bits */
#define CRC_CTRL_POLY_SIZE_8BITS_Pos        (4U)
#define CRC_CTRL_POLY_SIZE_8BITS_Msk        (0x1U << CRC_CTRL_POLY_SIZE_8BITS_Pos)  /*!< 0x00000010 */
#define CRC_CTRL_POLY_SIZE_8BITS            CRC_CTRL_POLY_SIZE_8BITS_Msk            /*!< 8 bits */
#define CRC_CTRL_POLY_SIZE_7BITS_Pos        (3U)
#define CRC_CTRL_POLY_SIZE_7BITS_Msk        (0x3U << CRC_CTRL_POLY_SIZE_7BITS_Pos)  /*!< 0x00000018 */
#define CRC_CTRL_POLY_SIZE_7BITS            CRC_CTRL_POLY_SIZE_7BITS_Msk            /*!< 7 bits */

/*!< REVID configuration */
#define CRC_CTRL_REVID_Pos                  (5U)
#define CRC_CTRL_REVID_Msk                  (0x3U << CRC_CTRL_REVID_Pos)            /*!< 0x00000060 */
#define CRC_CTRL_REVID                      CRC_CTRL_REVID_Msk                      /*!< REVID[1:0] bits (Reverse input data) */
#define CRC_CTRL_REVID_0                    (0x1U << CRC_CTRL_REVID_Pos)            /*!< 0x00000020 */
#define CRC_CTRL_REVID_1                    (0x2U << CRC_CTRL_REVID_Pos)            /*!< 0x00000040 */

#define CRC_CTRL_REVID_NOREV                0x00000000U                             /*!< No effect */
#define CRC_CTRL_REVID_BYTEREV_Pos          (5U)
#define CRC_CTRL_REVID_BYTEREV_Msk          (0x1U << CRC_CTRL_REVID_BYTEREV_Pos)    /*!< 0x00000020 */
#define CRC_CTRL_REVID_BYTEREV              CRC_CTRL_REVID_BYTEREV_Msk              /*!< Byte reverse */
#define CRC_CTRL_REVID_HALFREV_Pos          (6U)
#define CRC_CTRL_REVID_HALFREV_Msk          (0x1U << CRC_CTRL_REVID_HALFREV_Pos)    /*!< 0x00000040 */
#define CRC_CTRL_REVID_HALFREV              CRC_CTRL_REVID_HALFREV_Msk              /*!< Half-word reverse */
#define CRC_CTRL_REVID_WORDREV_Pos          (5U)
#define CRC_CTRL_REVID_WORDREV_Msk          (0x3U << CRC_CTRL_REVID_WORDREV_Pos)    /*!< 0x00000060 */
#define CRC_CTRL_REVID_WORDREV              CRC_CTRL_REVID_WORDREV_Msk              /*!< Word reverse */

#define CRC_CTRL_REVOD_Pos                  (7U)
#define CRC_CTRL_REVOD_Msk                  (0x1U << CRC_CTRL_REVOD_Pos)            /*!< 0x00000080 */
#define CRC_CTRL_REVOD                      CRC_CTRL_REVOD_Msk                      /*!< Reverse output data */

