ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415kx.h
#define I2C_CTRL2_ERRIEN_Pos                (8U)
#define I2C_CTRL2_ERRIEN_Msk                (0x1U << I2C_CTRL2_ERRIEN_Pos)          /*!< 0x00000100 */
#define I2C_CTRL2_ERRIEN                    I2C_CTRL2_ERRIEN_Msk                    /*!< Error interrupt enable */
#define I2C_CTRL2_EVTIEN_Pos                (9U)
#define I2C_CTRL2_EVTIEN_Msk                (0x1U << I2C_CTRL2_EVTIEN_Pos)          /*!< 0x00000200 */
#define I2C_CTRL2_EVTIEN                    I2C_CTRL2_EVTIEN_Msk                    /*!< Event interrupt enable */
#define I2C_CTRL2_DATAIEN_Pos               (10U)
#define I2C_CTRL2_DATAIEN_Msk               (0x1U << I2C_CTRL2_DATAIEN_Pos)         /*!< 0x00000400 */
#define I2C_CTRL2_DATAIEN                   I2C_CTRL2_DATAIEN_Msk                   /*!< Data transfer interrupt enable */
#define I2C_CTRL2_DMAEN_Pos                 (11U)
#define I2C_CTRL2_DMAEN_Msk                 (0x1U << I2C_CTRL2_DMAEN_Pos)           /*!< 0x00000800 */
#define I2C_CTRL2_DMAEN                     I2C_CTRL2_DMAEN_Msk                     /*!< DMA transfer enable */
#define I2C_CTRL2_DMAEND_Pos                (12U)
#define I2C_CTRL2_DMAEND_Msk                (0x1U << I2C_CTRL2_DMAEND_Pos)          /*!< 0x00001000 */
#define I2C_CTRL2_DMAEND                    I2C_CTRL2_DMAEND_Msk                    /*!< End of DMA transfer */

/******************  Bit definition for I2C_OADDR1 register  ******************/
/*!< ADDR1 configuration */
#define I2C_OADDR1_ADDR1_1_7                0x000000FEU                             /*!< Interface address */
#define I2C_OADDR1_ADDR1_8_9                0x00000300U                             /*!< Interface address */

#define I2C_OADDR1_ADDR1_0_Pos              (0U)
#define I2C_OADDR1_ADDR1_0_Msk              (0x1U << I2C_OADDR1_ADDR1_0_Pos)        /*!< 0x00000001 */
#define I2C_OADDR1_ADDR1_0                  I2C_OADDR1_ADDR1_0_Msk                  /*!< Bit 0 */
#define I2C_OADDR1_ADDR1_1_Pos              (1U)
#define I2C_OADDR1_ADDR1_1_Msk              (0x1U << I2C_OADDR1_ADDR1_1_Pos)        /*!< 0x00000002 */
#define I2C_OADDR1_ADDR1_1                  I2C_OADDR1_ADDR1_1_Msk                  /*!< Bit 1 */
#define I2C_OADDR1_ADDR1_2_Pos              (2U)
#define I2C_OADDR1_ADDR1_2_Msk              (0x1U << I2C_OADDR1_ADDR1_2_Pos)        /*!< 0x00000004 */
#define I2C_OADDR1_ADDR1_2                  I2C_OADDR1_ADDR1_2_Msk                  /*!< Bit 2 */
#define I2C_OADDR1_ADDR1_3_Pos              (3U)
#define I2C_OADDR1_ADDR1_3_Msk              (0x1U << I2C_OADDR1_ADDR1_3_Pos)        /*!< 0x00000008 */
#define I2C_OADDR1_ADDR1_3                  I2C_OADDR1_ADDR1_3_Msk                  /*!< Bit 3 */
#define I2C_OADDR1_ADDR1_4_Pos              (4U)
#define I2C_OADDR1_ADDR1_4_Msk              (0x1U << I2C_OADDR1_ADDR1_4_Pos)        /*!< 0x00000010 */
#define I2C_OADDR1_ADDR1_4                  I2C_OADDR1_ADDR1_4_Msk                  /*!< Bit 4 */
#define I2C_OADDR1_ADDR1_5_Pos              (5U)
#define I2C_OADDR1_ADDR1_5_Msk              (0x1U << I2C_OADDR1_ADDR1_5_Pos)        /*!< 0x00000020 */
#define I2C_OADDR1_ADDR1_5                  I2C_OADDR1_ADDR1_5_Msk                  /*!< Bit 5 */
#define I2C_OADDR1_ADDR1_6_Pos              (6U)
#define I2C_OADDR1_ADDR1_6_Msk              (0x1U << I2C_OADDR1_ADDR1_6_Pos)        /*!< 0x00000040 */
#define I2C_OADDR1_ADDR1_6                  I2C_OADDR1_ADDR1_6_Msk                  /*!< Bit 6 */
#define I2C_OADDR1_ADDR1_7_Pos              (7U)
#define I2C_OADDR1_ADDR1_7_Msk              (0x1U << I2C_OADDR1_ADDR1_7_Pos)        /*!< 0x00000080 */
#define I2C_OADDR1_ADDR1_7                  I2C_OADDR1_ADDR1_7_Msk                  /*!< Bit 7 */
#define I2C_OADDR1_ADDR1_8_Pos              (8U)
#define I2C_OADDR1_ADDR1_8_Msk              (0x1U << I2C_OADDR1_ADDR1_8_Pos)        /*!< 0x00000100 */
#define I2C_OADDR1_ADDR1_8                  I2C_OADDR1_ADDR1_8_Msk                  /*!< Bit 8 */
#define I2C_OADDR1_ADDR1_9_Pos              (9U)
#define I2C_OADDR1_ADDR1_9_Msk              (0x1U << I2C_OADDR1_ADDR1_9_Pos)        /*!< 0x00000200 */
#define I2C_OADDR1_ADDR1_9                  I2C_OADDR1_ADDR1_9_Msk                  /*!< Bit 9 */

#define I2C_OADDR1_ADDR1MODE_Pos            (15U)
#define I2C_OADDR1_ADDR1MODE_Msk            (0x1U << I2C_OADDR1_ADDR1MODE_Pos)      /*!< 0x00008000 */
#define I2C_OADDR1_ADDR1MODE                I2C_OADDR1_ADDR1MODE_Msk                /*!< Address mode */

/******************  Bit definition for I2C_OADDR2 register  ******************/
#define I2C_OADDR2_ADDR2EN_Pos              (0U)
#define I2C_OADDR2_ADDR2EN_Msk              (0x1U << I2C_OADDR2_ADDR2EN_Pos)        /*!< 0x00000001 */
#define I2C_OADDR2_ADDR2EN                  I2C_OADDR2_ADDR2EN_Msk                  /*!< Own address 2 enable */
#define I2C_OADDR2_ADDR2_Pos                (1U)
#define I2C_OADDR2_ADDR2_Msk                (0x7FU << I2C_OADDR2_ADDR2_Pos)         /*!< 0x000000FE */
#define I2C_OADDR2_ADDR2                    I2C_OADDR2_ADDR2_Msk                    /*!< Own address 2 */

/********************  Bit definition for I2C_DT register  ********************/
#define I2C_DT_DT_Pos                       (0U)
#define I2C_DT_DT_Msk                       (0xFFU << I2C_DT_DT_Pos)                /*!< 0x000000FF */
#define I2C_DT_DT                           I2C_DT_DT_Msk                           /*!< This field is used to store data received or to be transferred */

/*******************  Bit definition for I2C_STS1 register  *******************/
#define I2C_STS1_STARTF_Pos                 (0U)
#define I2C_STS1_STARTF_Msk                 (0x1U << I2C_STS1_STARTF_Pos)           /*!< 0x00000001 */
#define I2C_STS1_STARTF                     I2C_STS1_STARTF_Msk                     /*!< Start condition generation complete flag */
#define I2C_STS1_ADDR7F_Pos                 (1U)
#define I2C_STS1_ADDR7F_Msk                 (0x1U << I2C_STS1_ADDR7F_Pos)           /*!< 0x00000002 */
#define I2C_STS1_ADDR7F                     I2C_STS1_ADDR7F_Msk                     /*!< 0 ~ 7 bit address match flag */
#define I2C_STS1_TDC_Pos                    (2U)
#define I2C_STS1_TDC_Msk                    (0x1U << I2C_STS1_TDC_Pos)              /*!< 0x00000004 */
#define I2C_STS1_TDC                        I2C_STS1_TDC_Msk                        /*!< Data transfer complete flag */
#define I2C_STS1_ADDRHF_Pos                 (3U)
#define I2C_STS1_ADDRHF_Msk                 (0x1U << I2C_STS1_ADDRHF_Pos)           /*!< 0x00000008 */
#define I2C_STS1_ADDRHF                     I2C_STS1_ADDRHF_Msk                     /*!< Master 9 ~ 8 bit address head match flag */
#define I2C_STS1_STOPF_Pos                  (4U)
#define I2C_STS1_STOPF_Msk                  (0x1U << I2C_STS1_STOPF_Pos)            /*!< 0x00000010 */
#define I2C_STS1_STOPF                      I2C_STS1_STOPF_Msk                      /*!< Stop condition generation complete flag */
#define I2C_STS1_RDBF_Pos                   (6U)
#define I2C_STS1_RDBF_Msk                   (0x1U << I2C_STS1_RDBF_Pos)             /*!< 0x00000040 */
#define I2C_STS1_RDBF                       I2C_STS1_RDBF_Msk                       /*!< Receive data buffer full flag */
#define I2C_STS1_TDBE_Pos                   (7U)
#define I2C_STS1_TDBE_Msk                   (0x1U << I2C_STS1_TDBE_Pos)             /*!< 0x00000080 */
#define I2C_STS1_TDBE                       I2C_STS1_TDBE_Msk                       /*!< Transmit data buffer empty flag */
#define I2C_STS1_BUSERR_Pos                 (8U)
#define I2C_STS1_BUSERR_Msk                 (0x1U << I2C_STS1_BUSERR_Pos)           /*!< 0x00000100 */
#define I2C_STS1_BUSERR                     I2C_STS1_BUSERR_Msk                     /*!< Bus error flag */
#define I2C_STS1_ARLOST_Pos                 (9U)
#define I2C_STS1_ARLOST_Msk                 (0x1U << I2C_STS1_ARLOST_Pos)           /*!< 0x00000200 */
#define I2C_STS1_ARLOST                     I2C_STS1_ARLOST_Msk                     /*!< Arbitration lost flag */
#define I2C_STS1_ACKFAIL_Pos                (10U)
#define I2C_STS1_ACKFAIL_Msk                (0x1U << I2C_STS1_ACKFAIL_Pos)          /*!< 0x00000400 */
#define I2C_STS1_ACKFAIL                    I2C_STS1_ACKFAIL_Msk                    /*!< Acknowledge failure flag */
#define I2C_STS1_OUF_Pos                    (11U)
#define I2C_STS1_OUF_Msk                    (0x1U << I2C_STS1_OUF_Pos)              /*!< 0x00000800 */
#define I2C_STS1_OUF                        I2C_STS1_OUF_Msk                        /*!< Overload / underload flag */
#define I2C_STS1_PECERR_Pos                 (12U)
#define I2C_STS1_PECERR_Msk                 (0x1U << I2C_STS1_PECERR_Pos)           /*!< 0x00001000 */
#define I2C_STS1_PECERR                     I2C_STS1_PECERR_Msk                     /*!< PEC receive error flag */
#define I2C_STS1_TMOUT_Pos                  (14U)
#define I2C_STS1_TMOUT_Msk                  (0x1U << I2C_STS1_TMOUT_Pos)            /*!< 0x00004000 */
#define I2C_STS1_TMOUT                      I2C_STS1_TMOUT_Msk                      /*!< SMBus timeout flag */
#define I2C_STS1_ALERTF_Pos                 (15U)
#define I2C_STS1_ALERTF_Msk                 (0x1U << I2C_STS1_ALERTF_Pos)           /*!< 0x00008000 */
#define I2C_STS1_ALERTF                     I2C_STS1_ALERTF_Msk                     /*!< SMBus alert flag */

/*******************  Bit definition for I2C_STS2 register  *******************/
#define I2C_STS2_TRMODE_Pos                 (0U)
#define I2C_STS2_TRMODE_Msk                 (0x1U << I2C_STS2_TRMODE_Pos)           /*!< 0x00000001 */
#define I2C_STS2_TRMODE                     I2C_STS2_TRMODE_Msk                     /*!< Transmission mode */
#define I2C_STS2_BUSYF_Pos                  (1U)
#define I2C_STS2_BUSYF_Msk                  (0x1U << I2C_STS2_BUSYF_Pos)            /*!< 0x00000002 */
#define I2C_STS2_BUSYF                      I2C_STS2_BUSYF_Msk                      /*!< Bus busy flag transmission mode */
#define I2C_STS2_DIRF_Pos                   (2U)
#define I2C_STS2_DIRF_Msk                   (0x1U << I2C_STS2_DIRF_Pos)             /*!< 0x00000004 */
#define I2C_STS2_DIRF                       I2C_STS2_DIRF_Msk                       /*!< Transmission direction flag */
#define I2C_STS2_GCADDRF_Pos                (4U)
#define I2C_STS2_GCADDRF_Msk                (0x1U << I2C_STS2_GCADDRF_Pos)          /*!< 0x00000010 */
#define I2C_STS2_GCADDRF                    I2C_STS2_GCADDRF_Msk                    /*!< General call address reception flag */
#define I2C_STS2_DEVADDRF_Pos               (5U)
#define I2C_STS2_DEVADDRF_Msk               (0x1U << I2C_STS2_DEVADDRF_Pos)         /*!< 0x00000020 */
#define I2C_STS2_DEVADDRF                   I2C_STS2_DEVADDRF_Msk                   /*!< SMBus device address reception flag */
#define I2C_STS2_HOSTADDRF_Pos              (6U)
#define I2C_STS2_HOSTADDRF_Msk              (0x1U << I2C_STS2_HOSTADDRF_Pos)        /*!< 0x00000040 */
#define I2C_STS2_HOSTADDRF                  I2C_STS2_HOSTADDRF_Msk                  /*!< SMBus host address reception flag */
#define I2C_STS2_ADDR2F_Pos                 (7U)
#define I2C_STS2_ADDR2F_Msk                 (0x1U << I2C_STS2_ADDR2F_Pos)           /*!< 0x00000080 */
#define I2C_STS2_ADDR2F                     I2C_STS2_ADDR2F_Msk                     /*!< Received address 2 flag */
#define I2C_STS2_PECVAL_Pos                 (8U)
#define I2C_STS2_PECVAL_Msk                 (0xFFU << I2C_STS2_PECVAL_Pos)          /*!< 0x0000FF00 */
#define I2C_STS2_PECVAL                     I2C_STS2_PECVAL_Msk                     /*!< PEC value */

/*****************  Bit definition for I2C_CLKCTRL register  ******************/
#define I2C_CLKCTRL_SPEED_Pos               (0U)
#define I2C_CLKCTRL_SPEED_Msk               (0xFFFU << I2C_CLKCTRL_SPEED_Pos)       /*!< 0x00000FFF */
#define I2C_CLKCTRL_SPEED                   I2C_CLKCTRL_SPEED_Msk                   /*!< I2C bus speed config */
#define I2C_CLKCTRL_DUTYMODE_Pos            (14U)
#define I2C_CLKCTRL_DUTYMODE_Msk            (0x1U << I2C_CLKCTRL_DUTYMODE_Pos)      /*!< 0x00004000 */
#define I2C_CLKCTRL_DUTYMODE                I2C_CLKCTRL_DUTYMODE_Msk                /*!< Fast mode duty cycle */
#define I2C_CLKCTRL_SPEEDMODE_Pos           (15U)
#define I2C_CLKCTRL_SPEEDMODE_Msk           (0x1U << I2C_CLKCTRL_SPEEDMODE_Pos)     /*!< 0x00008000 */
#define I2C_CLKCTRL_SPEEDMODE               I2C_CLKCTRL_SPEEDMODE_Msk               /*!< Speed mode selection */

